{"pages":[{"tags":"pages","title":"О сообществе","loc":"http://pynsk.ru/pages/about.html","text":"PyNSK - первое Python сообщество в городе Новосибирск Сообщество имеет как онлайн и оффлайн составляющую: Оффлайн Мы встречаемся раз в месяц. На встречах слушаем доклады и много обсуждаем Python. Онлайн Группа в ВКонтакте - http://vk.com/pynsk - это основная группа сообщества, где публикуются свежие новости и посты Этот сайт - http://pynsk.ru/ - на нем публикуется архив статей сообщества, ссылки на доклады. Чат - https://gitter.im/PyNSK/PyNSK - чат, где мы общаемся"},{"tags":"Hardcore Python","title":"Hardcore Python: Пишем свой интерпретатор","loc":"http://pynsk.ru/posts/2015/Oct/29/hardcore-python-pishem-svoi-interpretator/","text":"Говорят, что отличный результат для мужчины — построить дом, вырастить сына и посадить дерево. А если ты программист, то ещё написать свой язык программирования. Сейчас уже нет чисто интерпретируемых языков, даже Python сначала компилируется в байт-код, а потом интерпретируется — исполняется. Но как это он делает? Чтобы узнать магию внутренностей интерпретаторов предлагаю цикл статей Let's Build A Simple Interpreter: http://ruslanspivak.com/lsbasi-part1/ http://ruslanspivak.com/lsbasi-part2/ http://ruslanspivak.com/lsbasi-part3/ http://ruslanspivak.com/lsbasi-part4/ http://ruslanspivak.com/lsbasi-part5/"},{"tags":"Пишем web-проекты","title":"Пишем web-проекты: Использование gevent для эмуляции высокой нагрузки","loc":"http://pynsk.ru/posts/2015/Oct/29/pishem-web-proekty-ispolzovanie-gevent-dlia-emuliatsii-vysokoi-nagruzki/","text":"Обязательное действие перед выпуском более-менее серьёзного проекта — тестирование производительности. На высоконагруженных проектах нужно точно знать, какую нагрузку они могут выдержать, причём заранее. Следовательно, нужен способ эмуляции высокой конкурентности, желательно чтобы в теории он позволял полностью загрузить канал траффиком. К тому же, неплохо было бы, чтобы для этого не нужно было использовать несколько десятков серверов. В докладе будет рассказано об опыте использования gevent для подобной задачи, что позволило бы обойтись одним t1.micro инстансом, с которого выполняется тестирование."},{"tags":"Пишем web-проекты","title":"Пишем web-проекты: Погружение в полнотекстовый поиск, используя Python","loc":"http://pynsk.ru/posts/2015/Oct/28/pishem-web-proekty-pogruzhenie-v-polnotekstovyi-poisk-ispolzuia-python/","text":"Чем больше/непонятней сайт, тем чаще используют поиск. В докладе Андрея Солдатенко вы сможете узнать как организовать хороший поиск по вашему сайту"},{"tags":"Учебные материалы","title":"Учебные материалы: Куда ползёт питон?","loc":"http://pynsk.ru/posts/2015/Oct/27/uchebnye-materialy-kuda-polziot-piton/","text":"Чем Python и его экосистема отличается от других языков программирования? Какая у Python ниша? Какие сильные и слабые стороны у языка и батареек? На все эти вопросы Григорий попробует ответить в своём обзорном докладе, рассказывающем о том, куда ползёт Python в 2015 году"},{"tags":"Синтаксис Python","title":"Синтаксис Python: raw-unicode-escape против u'\\xd0\\x9a'","loc":"http://pynsk.ru/posts/2015/Oct/26/sintaksis-python-raw-unicode-escape-protiv-uxd0x9a/","text":"Python 2 и проблемы с кодировками — это единое целое. И мало, что сами файлы с исходниками сохраняют в самых разных кодировках, так и текстовые файлы с данными этим грешат. Казалось бы, используй encode/decode и что тут думать. Но бывает, что декодируешь юникод и получаешь строку: u'\\xd0\\x9a\\xd1\\x83\\xd1\\x80\\xd1\\x83\\xd0\\xbc\\xd0\\xbe\\xd1\\x87' Юникодные символы в юникодной строке. И вот здесь гугл начинает молить о пощаде, предлагая вариант — составить словарь символов и букв и сделать replace. Но есть и более удобный вариант — кодек 'raw-unicode-escape' . И тогда, использование выглядит так: >>> u' \\xd0\\x9a\\xd1\\x83\\xd1\\x80\\xd1\\x83\\xd0\\xbc\\xd0\\xbe\\xd1\\x87 ' . encode ( 'raw-unicode-escape' ) Курумоч"},{"tags":"Математика в Python","title":"Математика в Python: Матрицы в NumPy","loc":"http://pynsk.ru/posts/2015/Oct/25/matematika-v-python-matritsy-v-numpy/","text":"Списки - встроенный тип Python, могут содержать любые элементы: целые, дробные числа, строки, объекты. Это великая сила Python, но в то же время и слабость — в отношении скорости работы. В стандартные дистрибутивы Python входит модуль array, реализующий аналог массивов C/C++, он может пригодиться для простейших расчётов с многомерными массивами, матрицами. NumPy — мощнейшая библиотека для научных вычислений. Написать здесь операции с матрицами так же просто, как и с обычными числами. Матрица в NumPy — это объект numpy.array, массив чисел одного типа, какой угодно размерности: 0 (одно число, скаляр), 1 (вектор), 2 (матрица), 3 (тензор третьего ранга)... Матрицы во многом похожи на списки и массивы модуля array: поддерживают индексацию с таким же синтаксисом и легко преобразуются в них. Перейдём к делу. Например, нужно посчитать произведение и сумму матриц, скаляров и векторов. Мы бы на бумаге записали так: A B C*D + E, где B,C — матрицы 2x2, D,E — вектор-столбцы, A — скаляр (число). import numpy as np A = 1.5 # обычное число A = np . array ([ 1.5 ]) # а можно и так B = np . diag (( 1.32 , 0.78 )) # треугольная, матрица, делаем диагональную матрицу B [ 0 , 1 ] = 3.12 # потом дописываем элемент B_12 (обозначение, как мы привыкли в институтах) C = np . zeros (( 1 , 2 )) # сначала делаем вектор-строку и заполняем нулями, C = np . concatenate (( C , [ ­ [ 3 , 2. ]])) # добавляем внизу вектор-строку (3, 2) C [ 0 ][ 0 ] = 0.97 # и для интереса сделаем элемент (1,1) ненулевым C = C . T # а теперь транспонируем, тоже для интереса D = np . array ([ 10 , 12 ], dtype = float ) # просто делаем вектор-столбец с дробными числами, # а точки писать лень (но и без dtype вычисления будут дробные, так как дробные числа уже есть) E = np . ones (( 2 , 1 ), dtype = float ) # вектор-столбец из единиц E *= 2.3 # домножим для интереса M = A * B * C * D + E # проще пареной репы!!! print B print C print D print E print M Результат: [ ­ [ 1.32 3.12 ] [ 0. 0.78 ]] [ ­ [ 0.97 3. ] [ 0. 2. ]] [ 10. 12. ] [ ­ [ 2.3 ] [ 2.3 ]] [ ­ [ 21.506 170.78 ] [ 2.3 30.38 ]] Мораль: производить действия с матрицами в NumPy так же просто, как и при рисовании их символов в тетради на парах линейной алгебры. Пусть этот пример выглядит наивным, но он показывает, что есть множество инструментов для конструирования матриц, не говоря уже о банальной инициализации известными элементами. А если речь идёт о матрицах 10x10? Трёхмерных, четырёхмерных? С комплексными числами? И даже с произвольными объектами вместо чисел (если определить арифметические действия над ними)? NumPy Вам в помощь."},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: timeit - измерим время работы!","loc":"http://pynsk.ru/posts/2015/Oct/25/tainstvo-standartnoi-biblioteki-timeit-izmerim-vremia-raboty/","text":"Представим мы придумали алгоритм, на пальцах оценили его быстродействие, закодили и получили медленно работающий софт. Что делать? куда бежать? С чего стоит начать? Да сначала стоит измерить сколько ресурсов (память, время, проц) кушает ваш софт. Уже имея числа на руках можно думать дальше. Для измерения временных затрат для вашего кода можно воспользоваться библиотекой timeit . А другие ресурсы измерим в след. раз. Она позволяет измерить время работы куска кода программы: >>> import timeit >>> timeit . timeit ( '\"-\".join(str(n) for n in range(100))' , number = 10000 ) 0.3018611848820001 >>> timeit . timeit ( '\"-\".join([str(n) for n in range(100)])' , number = 10000 ) 0.2727368790656328 >>> timeit . timeit ( '\"-\".join(map(str, range(100)))' , number = 10000 ) 0.23702679807320237 Ссылка для изучения: https://docs.python.org/3.4/library/timeit.html"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: zipimport - импортируем код из zip файлов","loc":"http://pynsk.ru/posts/2015/Oct/24/tainstvo-standartnoi-biblioteki-zipimport-importiruem-kod-iz-zip-failov/","text":"Еще в далеком Python 2.3 был добавлен модуль zipimport . Этот модуль упростил возможность импорта из zip файлов: $ python Python 2.3 ( #1, Aug 1 2003, 19:54:32) >>> import sys >>> sys . path . insert ( 0 , '/tmp/example.zip' ) # Add .zip file to front of path >>> import jwzthreading >>> jwzthreading . __file__ '/tmp/example.zip/jwzthreading.py' (больше примеров по см. по первой ссылке) Конечно, такой функционал мало кому нужен, но давайте придумаем какой-то use-case - пофантазируем. Пишите свои мысли в комментариях Предположим что есть динамическая система, какая-то жутко настраиваемая система - в зависимости от дня недели выполняется код. Тогда можно реализовать в коде выкачивание нужного архива с вашего сервера в виде zip файла и затем с помощью zipimport исполнять код. Ссылки: https://pymotw.com/2/zipimport/ https://docs.python.org/2/library/zipimport.html https://docs.python.org/2.3/whatsnew/node5.html http://habrahabr.ru/company/acronis/blog/208378/"},{"tags":"Учебные материалы","title":"Учебные материалы: Что нового в Python 3.5","loc":"http://pynsk.ru/posts/2015/Oct/23/uchebnye-materialy-chto-novogo-v-python-35/","text":"Когда полезны аннотации типов? Станет ли асинхронное программирование обычной практикой с новыми async-await? Устроим обсуждение этих и других новинок Python 3.5. Все это вы сможете узнаете в докладе Андрея Власовских"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: .pyi файлы - python stubs","loc":"http://pynsk.ru/posts/2015/Oct/23/tainstvo-standartnoi-biblioteki-pyi-faily-python-stubs/","text":"PEP 484 добавил в Python расширенные возможности опциональной типизации. Польза от этого функционала большая - возможность создать статический анализатор Python программ, а значит еще до запуска узнать об многих ошибках. Появился модуль typing, который в 3.5 есть по умолчанию, а начиная с 3.2 можно установить с PyPi Но что делать с кодом на 2.7? Хочется же больше ошибок вылавливать. Здесь на пользу приходят python stubs - .pyi файлы. Пример такого файла: def addTest ( test : Testable ) -> None : ... def addTests ( tests : Iterable [ Testable ]) -> None : ... def run ( result : TestResult ) -> None : ... def debug ( self ) -> None : ... def countTestCases ( self ) -> int : ... Многоточия - это часть формата. В файле .pyi декларируются функции с типами аргументов и возвращаемых значений, а тело уже будет их обычных .py файлов Смысл: пользователь размечает часть своего кода типами, а автоматизированные средства будут проверять и оповещать о возможных ошибках. Но есть и недостатки - на данный момент мало инструментов, которые умеют такую проверку делать. Ссылки для изучения: http://www.mypy-lang.org/wiki/CreatingStubsForPythonModules https://www.python.org/dev/peps/pep-0484/"},{"tags":"Интересные концепции","title":"Интересные концепции: утиная типизация","loc":"http://pynsk.ru/posts/2015/Oct/22/interesnye-kontseptsii-utinaia-tipizatsiia/","text":"Слышали фразу: \"Если что-то выглядит как утка, плавает как утка и крякает как утка, то, вероятно, это утка\"? Эта поговорка характеризует утиную типизацию == утипизацию Смысл утиной типизации заключается в ослаблении типов. Вместо того чтобы заботиться о точном классе объекта мы заботимся о том какие методы для него можно вызвать и какие операции над ним можно выполнять. Таким образом, обычным делом становится просто передать объект методу, зная, что при неправильном использовании будет выброшено исключение ( exception ). Например: если есть код def method ( obj ): obj . start () При утиной типизации мы не заботимся о типе объекта obj , нам лишь важно, что у него есть метод start . Если же такого метода нет, то исключение нас разочарует. Утиная типизация решает некоторые проблемы иерархической типизации: невозможность явно указать (путем наследования) на совместимость интерфейса со всеми настоящими и будущими интерфейсами, с которыми он идейно совместим; экспоненциальное увеличение числа связей в иерархии типов."},{"tags":"Учебные материалы","title":"Учебные материалы: познаем Django","loc":"http://pynsk.ru/posts/2015/Oct/21/uchebnye-materialy-poznaem-django/","text":"Django - web-фреймворк. Обладает отличной документацией, которую можно читать долго и упорно. Есть даже тутроиал по созданию блога. Вот только есть \"минус\" - проходишь туториал с блогом и не знаешь где еще добыть структурированной информации. Да еще и актуальной. Мы сделали опрос и получили следующие советы: https://code.djangoproject.com/wiki/Tutorials Данный ресурс содержит ссылки на множество учебных пособий по Django. Все разбито по разделам. Много практики! http://djbook.ru/ Русскоязычный ресурс, много готового кода. Быстро отвечают на вопросы. И два ресурса с видео: https://godjango.com/ - различные django скринкасты https://www.youtube.com/user/MickeySoFine1972/videos - видео-уроки по Django А какие django ресурсы знаете вы?"},{"tags":"Извлечение информации","title":"Извлечение информации:  lxml - парсим XML и HTML","loc":"http://pynsk.ru/posts/2015/Oct/21/izvlechenie-informatsii-lxml-parsim-xml-i-html/","text":"lxml это быстрая и гибкая библиотека для обработки разметки XML и HTML на Python. Она снабжена поддержкой языка запросов XML (XPath) и языка преобразования XML-документов (XSLT) и предоставляет API ElementTree. Много где можно найти что ее называют \"быстрой\". Для обоснования этого прилагательного прошу ознакомиться со страницей - http://lxml.de/performance.html Пример использования: xml = '''<?xml version=\"1.0\" encoding=\"UTF-8\"?> <soft> <os> <item name=\"linux\" dist=\"ubuntu\"> This text about linux </item> <item name=\"mac os\"> Apple company </item> <item name=\"windows\" dist=\"XP\" /> </os> </soft>''' from lxml import etree tree = etree . XML ( xml ) # Парсинг строки #tree = etree.parse('1.xml') # Парсинг файла nodes = tree . xpath ( '/soft/os/item' ) # Открываем раздел for node in nodes : # Перебираем элементы print node . tag , node . keys (), node . values () print 'name =' , node . get ( 'name' ) # Выводим параметр name print 'text =' ,[ node . text ] # Выводим текст элемента # Доступ к тексту напрямую, с указанием фильтра print 'text1' , tree . xpath ( '/soft/os/item[@name=\"linux\"]/text()' ) print 'text2' , tree . xpath ( '/soft/os/item[2]/text()' ) # Доступ к параметру напрямую print 'dist' , tree . xpath ( '/soft/os/item[@name=\"linux\"]' )[ 0 ] . get ( 'dist' ) # Выборка по ключу print 'dist by key' , tree . xpath ( '//*[@name=\"windows\"]' )[ 0 ] . get ( 'dist' ) Вот и ссылки для изучения: http://habrahabr.ru/post/220125/ http://lxml.de/ https://pypi.python.org/pypi/lxml"},{"tags":"Синтаксис Python","title":"Синтаксис Python: слайсы/срезы","loc":"http://pynsk.ru/posts/2015/Oct/19/sintaksis-python-slaisysrezy/","text":"Синтаксис Python легкий, читаемый. Хочется упомянуть массивы (как структура с последовательными элементами). В Python они бывают разные - list , tuple , строки Операции с массивами: Получить копию Получить первые/последние N элементов Получить N элементом с позиции M Получить каждый N элемент Развернуть Все эти операции и их комбинации отлично выполняются оператором [] - метод __getitem__ Для примера: >>> s = [ 1 , 2 , 3 , 4 , 6 ] #простой список >>> s [:] #копия списка, часто очень полезно [ 1 , 2 , 3 , 4 , 6 ] >>> s [ 1 :] # все элементы кроме первого [ 2 , 3 , 4 , 6 ] >>> s [ - 3 :] # последние 3 элемента [ 3 , 4 , 6 ] >>> s [ 2 : - 2 ] #откидываем первые и последние 2 [ 3 ] s [:: 2 ] #парные элементы [ 1 , 3 , 6 ] >>> s [ 1 : 4 : 2 ] #элементы с первого по четвертый с шагом 2 [ 2 , 4 ] Очень подробная статья с примерами: http://habrahabr.ru/post/89456/"},{"tags":"Синтаксис Python","title":"Синтаксис Python: переменная __all__","loc":"http://pynsk.ru/posts/2015/Oct/19/sintaksis-python-peremennaia-__all__/","text":"Вы наверное слышали фразу \"wild import - зло\". В коде это выглядит так from my_super_module import * Ответ почему это \"зло\" очень простой - вы импортируете всё - то что надо и то что не надо. А значит вы можете смело перегрузить какой-то метод. Как же быть? Можно импортировать только нужные переменные и функции/классы, что является правильным подходом. Но ведь должен быть альтернативный вариант. Он есть - это переменная __all__ __all__ в Pythone - это список публичных объектов данного модуля. Например, есть некий mymodule.py , в нем очень много объектов, и не требуется давать пользоваться ими всеми (например, какие-то приватные функции есть). В __all__ в mymodule.py вы списком определяете названия объектов, которые можно импортировать: __all__ = [ \"MyClass\" , \"MyClass2\" ] И тогда конструкция from mymodule import * Импортирует только те объекты, которые вы описали в __all__ ."},{"tags":"Учебные материалы","title":"Учебные материалы: сборник ООП паттернов","loc":"http://pynsk.ru/posts/2015/Oct/17/uchebnye-materialy-sbornik-oop-patternov/","text":"ООП преподают везде. В школе, в универе, в колледже, на курсах, упоминают в статьях, есть даже много книг на эту тему - например, банда четырех. Важным моментом ОО это паттерны. Это набор узаконенных хитростей и хаков, которые позволяют обходить недостатки самого ООП. По ссылке https://github.com/faif/python-patterns вы сможете найти готовый код для множества паттернов. А как вы считаете, где ООП устапает ФП (функциональному программированию), а где превосходит?"},{"tags":"Hardcore Python","title":"Hardcore Python: как PyPy запускает твой код","loc":"http://pynsk.ru/posts/2015/Oct/16/hardcore-python-kak-pypy-zapuskaet-tvoi-kod/","text":"PyPy - интерпретатор Python написанный на Python. Прелесть PyPy что он работает быстрее чем стандартный Python. В этом видео вы сможете узнать за счет чего это происходит"},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: использование переменной _","loc":"http://pynsk.ru/posts/2015/Oct/16/opyt-razrabotchikov-ispolzovanie-peremennoi-_/","text":"Хорошие имена переменных - это признак хорошего кода. Для циклов часто используют одно-буквенные переменные, для временных переменных тоже короткие, для глобальных - ЗАГЛАВНЫЕ. Есть и другие рекомендации. Все они написаны кровью из глаз разработчиков. Перейдем к заголовку и сразу пример: Пускай есть функция, которая возвращает 3 значения. def super_function (): .... return a , b , c Функция возвращает три значения, а нам в данном кусе кода необходимо только 2, а может одно? Пускай среднее. Куда \"потерять\" первую и третью переменную? В этом случае может однобуквенная переменная _ _ , value , _ = super_function () Что произошло? Мы сохранили среднее значение в переменную value, а два других в _. Переменная с названием _ это такая же как и value, ничем не примечательна кроме названия. Оно как бы пустое, очень короткое, мало внимания привлекает. Рекомендуем использовать для значений, которые используются единожды в коде."},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: сериализуем данные с помощью marshal","loc":"http://pynsk.ru/posts/2015/Oct/14/tainstvo-standartnoi-biblioteki-serializuem-dannye-s-pomoshchiu-marshal/","text":"Наверное, вы слышали про модуль Pickle, который умеет сериализовать объект в бинарный вид, который можно потом сохранить/загрузить в /из файл. А модуль marshal сериализует объект в текстовый вид. Получив строку вы можете отправить ее другу по email, а уже из строки снова получить объект Особенности модуля: Данные сохраняются в платформонезависимом формате. Поддерживаются только None, целые числа, длинные целые числа, числа с плавающей точкой, комплексные числа, строки, строки Юникода, кортежи, списки, словари и объекты с программным кодом. Списки, кортежи и словари могут содержать только объекты поддерживаемых типов. Экземпляры классов и рекурсивные ссылки в списках, кортежах и словарях не поддерживаются. Модуль marshal не обеспечивает защиту от ошибочных или злонамеренных данных и не должен использоваться для чтения данных, полученных из непроверенных источников. Модуль marshal имеет значительно более высокую производительность, чем модуль pickle, и имеет менее широкие возможности."},{"tags":"Интересные концепции","title":"Интересные концепции: fuzzy-testing  - тестирование грубой силой","loc":"http://pynsk.ru/posts/2015/Oct/13/interesnye-kontseptsii-fuzzy-testing-testirovanie-gruboi-siloi/","text":"Тестирование программ повышает уверенность в ее способности работать. Есть даже большие школы, которые говорят о тестах, например, TDD, BDD. У ручных тестов есть недостаток, среди прочих - тесты пишет человек. В следствии этого - он не сможет проверить работу функции/класса/etc на всех данных. А когда нам быть уверенным что даже на самых невалидных данных работает корректно, то без случайных данных не обойтись. fuzz-testing (Фаззинг) – методика тестирования, при которой на вход программы подаются невалидные, непредусмотренные или случайные данные. Фаззинг позволяет расширить количество проверок за счет автоматической генерации данных. От сюда и вытекают недостатки - скорость прохождения тестов падает, есть большие сложности с генерацией сложных данных. Тяжело посчитать процент покрытия кода. Тяжело воспроизводить неправильные проходы тестов. Инструментов, которые по принципу xUnit - две строчки написал и работает тест - для фаззинга нет. Или автор ошибается? Подскажите в комментариях Ссылки: http://habrahabr.ru/post/128503/ https://www.ibm.com/developerworks/library/j-fuzztest/"},{"tags":"Полезные инструменты","title":"Полезные инструменты: fabric - автоматизируем рутину","loc":"http://pynsk.ru/posts/2015/Oct/13/poleznye-instrumenty-fabric-avtomatiziruem-rutinu/","text":"Ситуация: написали web-проект, свой, домашний, а может и на работе. Надо его опубликовать в Интернет - задеплоить. Зашли на сервер, активировали venv, скачали новые исходники из репозитория, накатили миграции, обновили static-файлы, перезапустили, предположим, celery, перезапустили uwsgi. И тут, поняли что забыли раскоментировать строчку в коде. Делаем коммит, снова заходим на сервер, активировали venv.... Зачем вся эта рутина с деплоем? Может есть способ проще? Мы же IT-шники, давайте напишем скрипт. Здесь то на помощь и приходит fabric - инструмент командной строки. fabric предоставляет обертку над командной строкой. Вы пишите fab файл с вашим сценарием деплоя. Например. from fabric.api import run def host_type (): run ( 'uname -s' ) А затем запускаете на нескольких (или одной) удаленной машине $ fab -H localhost,linuxbox host_type [ localhost ] run: uname -s [ localhost ] out: Darwin [ linuxbox ] run: uname -s [ linuxbox ] out: Linux Done. Disconnecting from localhost... done . Disconnecting from linuxbox... done . Все очень просто http://www.fabfile.org/"},{"tags":"Интересные концепции","title":"Интересные концепции: какой смысл с Объектном подходе?","loc":"http://pynsk.ru/posts/2015/Oct/12/interesnye-kontseptsii-kakoi-smysl-s-obektnom-podkhode/","text":"В Интернет часто говорят об ООП, об объектах. Так какой смысл во всем этом? Какая польза, недостатки? Соображения на эту темы вы сможете найти в видео:"},{"tags":"Синтаксис Python","title":"Синтаксис Python: do...while","loc":"http://pynsk.ru/posts/2015/Oct/12/sintaksis-python-dowhile/","text":"Цикл do while отличается от цикла while тем, что в do while сначала выполняется тело цикла, а затем проверяется условие продолжения цикла. Из-за такой особенности do while называют циклом с постусловием. Таким образом, если условие do while заведомо ложное, то хотя бы один раз блок операторов в теле цикла do while выполнится. Иииии.... такой конструкции - do...while нет в Python. Написать цикл с постусловие можно так: while True : stuff () if fail_condition : break или так stuff () while not fail_condition : stuff ()"},{"tags":"Python проекты","title":"Python проекты: интерпретатор PyPy","loc":"http://pynsk.ru/posts/2015/Oct/10/python-proekty-interpretator-pypy/","text":"PyPy — это интерпретатор Python, который написан на Python (RPython) и может компилировать сам себя. Основное отличие от обычного CPython — наличие JIT компилятора. Прелесть JIT компилятора в том, что в течении работы программы оптимизируются ее части. Скорость исполнения кода на PyPy выше. На сайте http://speed.pypy.org/ вы можете найти сравнения CPython и PyPy. На сайте есть график (в самом низу): На графике видно, что скорость исполнения одного и того же кода на CPython и PyPy различается в среднем в 7 раза. Неплохо да? Ничего не изменяли в программе, а прирост в 7 раз получили. Да еще и памяти кушает меньше с многопоточностью там хорошо. А теперь ложка дегтя: PyPy развивается медленно, сейчас две версии: одна базируется на CPython 2.7.10, другая на 3.2.5 Так как PyPy имеет JIT компилятор, то есть время разогрева. Это такое время, когда код и данные оптимизируются. Не все библиотеки поддерживают PyPy Ссылочки: http://pypy.org/ http://www.ibm.com/developerworks/ru/library/os-pypy-intro/"},{"tags":"Hardcore Python","title":"Hardcore Python: переопределяем механизм импорта","loc":"http://pynsk.ru/posts/2015/Oct/08/hardcore-python-pereopredeliaem-mekhanizm-importa/","text":"В стандартной Python начиная с 2.3 существует механизм импорт-хуков. Зачем они нужны? Все очень просто - захотелось добавить поддержку импорта из .zip архивов. Ява такое может (.jar) - чем Питон хуже? Но открывать редактор только ради .zip не очень... Поэтому Python умеет загружать модули из базы данных или с соседнего сервера. Механизм механизм импорт-хуков реализован с помощью: sys.meta_path sys.path_hooks sys.path_import_cache Как ими пользоваться отлично описано в статье Андрея Светлова (1 ссылка в приложении), поэтому здесь повторять не буду. Ссылки чтобы сломать мозг: http://asvetlov.blogspot.ru/2010/05/3.html https://www.python.org/dev/peps/pep-0302/ https://docs.python.org/3/library/sys.html http://xion.org.pl/2012/05/06/hacking-python-imports/"},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: замыкания (closure). Зачем и почему.","loc":"http://pynsk.ru/posts/2015/Oct/08/opyt-razrabotchikov-zamykaniia-closure-zachem-i-pochemu/","text":"В синтаксисе Python один и тот же символ или конструкция часто используется для разных целей Возможно вы встречались с подобным кодом: def outer_func ( x ): def inner_func ( y ): # inner_func замкнуло в себе х return y + x return inner_func Похож на декоратор. Это называется замыканием. Это более общий случай декоратора. Смысл замыкания состоит в том, что определение функции \"замораживает\" окружающий её контекст на момент определения. Это может делаться различными способами, например, за счёт параметризации создания функции Такой подход позволяет: Устранить жестко кодированные константы Убрать глобальные переменные из кода Увеличить производительность Если первые два пункта весьма понятны, то третий поясню. В Python загрузка переменных в SCOPE (локальную область) долгий процесс (сравнительно), поэтому чем реже это делается - тем быстрее код. Пример: функция, которая делает insert в базу данных. Можно объявить коннект в замыкании и использовать. Есть один нюанс. В Питоне замкнутые переменные доступны только для чтения. Чтобы обойти такое ограничение, нужно замыкать переменные в изменяемые переменные, например, в список. Сами замкнутые переменные нельзя будет перезаписывать, а вот содержимое контейнера - пожалуйста. Замкнемся на ссылки: http://blog.jetfix.ru/post/zamykaniya-v-python-chto-eto-i-s-chem-ih-edyat https://www.ibm.com/developerworks/ru/library/l-python_details_03/"},{"tags":"Пишем web-проекты","title":"Пишем web-проекты: полиморфные связи или Foreign Key на две Django модели","loc":"http://pynsk.ru/posts/2015/Oct/07/pishem-web-proekty-polimorfnye-sviazi-ili-foreign-key-na-dve-django-modeli/","text":"Представим ситуацию. Есть модель Текст (заголовок, тело, теги) и модели Новость, Продукт, Реклама, которые имеют свои уникальные параметры. Необходимо связать Текст и все остальные - вполне логичное желание. Как можно поступить: Добавить Foreign Key в Текст (т.е. будет N=3 Foreign Key полей) Сделать отдельные модели для связи - будет 3 таблицы для связки. (вручную их сделаем) Сделать 2 поля, одно из которых будет говорить, какая модель имеется в виду, а второе – хранить ключ этой модели. + добавить свойство, которое будет возвращать запись из нужной модели (делать нужный query запрос) Первый вариант не подходит, потому что каждая новая модель будет добавлять еще одну Foreign Key связь Второй не очень, потому что N моделей - N дополнительных таблиц делать руками А вот третий вариант неплохой. Он и реализован в Django и состоит из двух компонентов: Content Types Framework и Generic Relations. Вот простой пример: реализуем систему тэгов(ярлычков), которая могла бы выглядеть так from django.db import models from django.contrib.contenttypes.fields import GenericForeignKey from django.contrib.contenttypes.models import ContentType class TaggedItem ( models . Model ): tag = models . SlugField () content_type = models . ForeignKey ( ContentType ) object_id = models . PositiveIntegerField () content_object = GenericForeignKey ( 'content_type' , 'object_id' ) def __str__ ( self ): # __unicode__ on Python 2 return self . tag Обычное поле ForeignKey может \"указывать\" только на одну модель, что означает, - если в модели TaggedItem есть поле ForeignKey, его можно \"связать\" с одной и только одной моделью, для которой и будут сохраняться тэги. Приложение contenttypes предоставляет нам поле специального типа (GenericForeignKey), которое решает обозначенную выше проблему и позволяет создать связь с любой моделью Ссылки: https://docs.djangoproject.com/en/1.8/ref/contrib/contenttypes/ http://djbook.ru/rel1.8/ref/contrib/contenttypes.html http://axiacore.com/blog/how-use-genericforeignkey-django/ http://www.ikrvss.ru/2010/11/09/django-polymorphic-foreign-key/"},{"tags":"Учебные материалы","title":"Учебные материалы: научная графика в python","loc":"http://pynsk.ru/posts/2015/Oct/06/uchebnye-materialy-nauchnaia-grafika-v-python/","text":"На русском языке не так много хороший книг, но есть. Среди них выделяется пособие Шабанова Павла. Данное электронное пособие на русском языке посвящено работе с научной графикой с помощью графической библиотекой matplotlib языка программирования python. Учебник предназначен для всех желающих освоить библиотеку matplotlib для создания научной графики в python. Книга будет интересна студентам, аспирантам и научным сотрудникам всех возрастов. Главная цель пособия - облегчить изучение библиотеки matplotlib и предложить ряд готовых решений для создания научной графики высокого публикационного качества. Приведённые в учебнике примеры показывают возможности языка python для визуализации результатов научной деятельности. Ссылка на книгу: https://github.com/whitehorn/Scientific_graphics_in_python"},{"tags":"Полезные инструменты","title":"Полезные инструменты: tox как средство тестирования","loc":"http://pynsk.ru/posts/2015/Oct/06/poleznye-instrumenty-tox-kak-sredstvo-testirovaniia/","text":"Если вы автор Python-библиотеки, то скорее всего вам необходимо поддерживать несколько версий Python. Стандартный набор - 2.6, 2.7, 3.3, 3.4 и сейчас уже 3.5. Поддерживать несколько версий Python помогают тесты. Не секрет, что тесты помогают допускать меньше ошибок во время поддержки проекта. Например, вы можете смелее делать рефакторинг и быть уверены, что функционал который проверяют тесты работает. Пускай написали тесты для озвученных версий Python, как их запускать? Постоянно менять venv и тыкать python run_test.py? Есть удобнее инструмент - tox . tox - это средство автоматизации, которое позволяет свести запуск тестирования до одной команды (а можно и до 0). В конфиг файле tox.ini вы можете указать: Что установить Какие версии Python использовать Что сделать перед запуском тестов Как запускать тесты Что делать после запуска тестов (например, сделать отчет с помощью coverage, послать отчет на email) Конфиг файл может выглядеть так: [tox] envlist = py26,py27 [testenv] deps = pytest # install pytest in the venvs commands = py.test # or 'nosetests' or ... Ссылка на документацию: https://tox.readthedocs.org/en/latest/"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: functools.lru_cache — кэшируем результат выполнения функции","loc":"http://pynsk.ru/posts/2015/Oct/05/tainstvo-standartnoi-biblioteki-functoolslru_cache-keshiruem-rezultat-vypolneniia-funktsii/","text":"Начиная с версии 3.2, в Python появилась возможность стандартными средствами организовать мемоизацию. Иными словами, кэшировать результаты вызова функции. Этот механизм представлен в виде декоратора в модуле functools и называется lru_cache (least recently used cache). На примере изъезженных чисел Фибоначчи это выглядит так: @lru_cache ( maxsize = None ) def fib ( n ): if n < 2 : return n return fib ( n - 1 ) + fib ( n - 2 ) >>> [ fib ( n ) for n in range ( 16 )] [ 0 , 1 , 1 , 2 , 3 , 5 , 8 , 13 , 21 , 34 , 55 , 89 , 144 , 233 , 377 , 610 ] >>> fib . cache_info () CacheInfo ( hits = 28 , misses = 16 , maxsize = None , currsize = 16 ) Схема вычисления числа Фибоначчи для 6 без кэша: Легко заметить, что есть повторяющиеся поддеревья, которые можно заново не вычислять. Однако, если у нас нет кэша, то куча времени уйдет на вычисление уже известных значений. Декоратор @lru_cache добавляет кэш необходимого размера (по умолчанию ёмкостью в 128 результатов), тем самым позволяя ускорить исполнение кода. Ссылка для изучения: - https://docs.python.org/3.4/library/functools.html"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: multiprocessing","loc":"http://pynsk.ru/posts/2015/Oct/04/tainstvo-standartnoi-biblioteki-multiprocessing/","text":"GIL Python снимает множество головной боли с программиста, но и не дает малой кровью использовать всю мощь CPU. А что если реально надо быстрее исполнить код? Например, надо сделать 1000 запросов в web. Можно завести несколько параллельных потоков или даже процессов. Вот с процессами только беда - как их синхронизировать между собой? В этом случае выходит на сцену модуль multiprocessing . multiprocessing позволяет работать с процессам как с потоками. Это значит, что модуль берет на себя проблему синхронизации отдельных Python-процессов. Много процессов - много GIL'ов (каждый в своем процессе) - нет проблем с использованием процессора. Пример использования может быть такой: from subprocess import Popen , PIPE from multiprocessing import Process , Queue def execute ( queue ): proc = Popen ( \"python ./dsTest.py\" , shell = True , stdout = PIPE ) proc . wait () # дождаться выполнения queue . put ( proc . communicate ()[ 0 ]) ## получить то, что вернул подпроцесс allProcesses = [] queue = Queue () for i in xrange ( 10 ): p = Process ( target = execute , args = ( queue ,)) allProcesses . append ( p ) p . start () for p in allProcesses : p . join () for i in xrange ( queue . qsize () ): print queue . get () Казалось бы, много процессов - процессор заполнен на полную, но есть же лежка дегтя? Ложка дегтя - это синхронизация процессов. Именно на этом процессе могут быть основные траты ресурсов. Читаем дальше по ссылкам: https://docs.python.org/3.5/library/multiprocessing.html https://pymotw.com/2/multiprocessing/ http://toly.github.io/blog/2014/02/13/parallelism-in-one-line/ https://www.ibm.com/developerworks/ru/library/l-python_details_05/ http://antonkonovalov.blogspot.ru/2011/12/python.html"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: logging","loc":"http://pynsk.ru/posts/2015/Oct/03/tainstvo-standartnoi-biblioteki-logging/","text":"Logging — библиотека для удобного ведения логов в Python В любой разработке приходится рано или поздно вести логи, ведь не отдашь же заказчику программу где отладочные сообщения выводятся с помощью print, да и в дальнейшем если у заказчика что то пойдет не так то можно просто попросит показать лог и понять в чем проблема(в большинстве случаев). В чем же мощь logging: Легко можно поместить указатель времени в каждое сообщение Вы можете использовать разные уровни срочности ваших сообщений и фильтровать их по этому уровню Когда Вы захотите позже найти / изменить лог-сообщения Вы не перепутаете их с другим выводом команды print Если Вы хотите вывести лог в файл, то очень легко будет игнорировать вывод лог-сообщений Чтобы начать использовать logging почти ничего делать не надо: import logging # Сообщение отладочное logging . debug ( u'This is a debug message' ) # Сообщение информационное logging . info ( u'This is an info message' ) # Сообщение предупреждение logging . warning ( u'This is a warning' ) # Сообщение ошибки logging . error ( u'This is an error message' ) # Сообщение критическое logging . critical ( u'FATAL!!!' ) Это только базовая возможность logging , обо всех возможностях по ссылкам: https://docs.python.org/3.5/library/logging.html http://python-lab.blogspot.ru/2012/08/print-logging-python.html http://habrahabr.ru/post/144566/"},{"tags":"Интересные концепции","title":"Интересные концепции: mixin'ы (примеси)","loc":"http://pynsk.ru/posts/2015/Oct/01/interesnye-kontseptsii-mixiny-primesi/","text":"В определенных случаях множественное наследование это зло. Добро - когда классы родители не перекрывают друг друга. Частный случай такой схемы - примиси == миксины == mixin == mix in. Концепция примисей строится на идеи четкого разделения свойств и методов для сущностей. Например, если есть летающее животное, то можно смело иметь метод fly; если есть раскрашиваемый объект, то можно завести методы \"покрасить\", и два состояния - \"раскрашен\" ( bool ) и цвет. Использование миксин выглядит так: class Mixin1 ( object ): def test ( self ): print \"Mixin1\" class Mixin2 ( object ): def test ( self ): print \"Mixin2\" class MyClass ( BaseClass , Mixin1 , Mixin2 ): pass (смотрели видео \"Super - это супер\"?) В чем отличие от обычного наследования? По синтаксису - ни в чем. Отличия на уровне договоренностей и использовании - в mixin-класс помещают все необходимое и достаточное для определения сущности. Пример: есть изменяемый объект - все действия с таким объектом храним в миксине. есть итерируемый объект - тоже миксин. Комбинируем два этих элемента и получаем интерируемый изменяемый объект. Погружаемся в множественное наследование: http://qualcode.ru/article/python_mixin/ https://www.ianlewis.org/en/mixins-and-python http://www.o2b.ru/python-mixins/ http://habrahabr.ru/post/140298/"},{"tags":"Полезные инструменты","title":"Полезные инструменты: pythontutor.com","loc":"http://pynsk.ru/posts/2015/Oct/01/poleznye-instrumenty-pythontutorcom/","text":"Полезные инструменты: pythontutor.com Представим ситуацию, вы читаете лекцию, пускай студентам. Хочется все по шагам и подробно рассказать о данном куске кода. Можно вести славеса пол часа, а можно продемонстрировать с помощью http://www.pythontutor.com/"},{"tags":"Полезные инструменты","title":"Полезные инструменты: pylint - в поисках ошибок","loc":"http://pynsk.ru/posts/2015/Sep/30/poleznye-instrumenty-pylint-v-poiskakh-oshibok/","text":"Статический анализ кода — анализ кода без реального исполнения кода. Под словом \"анализ\" можно понимать многое - что код соответствует PEP8, что код безопасный (все типы верно приведены), что код не содержит логических ошибок. Самым придирчивым анализатором является pylint. Pylint анализирует исходный код, выводит небольшую статистику по нему и делает около 150 проверок на разного рода ошибки. Все найденные ошибки выводятся в списке. Все сообщения об ошибках делятся на 4 типа: ошибки; потенциальные ошибки; следование стилистике и соглашениям (PEP8 и прочее); предложения по рефакторингу. Узнать мощь инструмента можно по ссылкам: http://www.pylint.org/ http://tiendil.livejournal.com/23215.html http://dmalinovsky.blogspot.ru/2011/03/python.html http://rtfm.co.ua/python-pylint-analiz-oshibok-i-kachestva-koda/ http://habrahabr.ru/post/114745/"},{"tags":"Полезные библиотеки","title":"Полезные библиотеки: langid.py","loc":"http://pynsk.ru/posts/2015/Sep/30/poleznye-biblioteki-langidpy/","text":"Представим ситуацию: есть блог, в котором публикуются посты на двух языках (а может и на 10). Необходимо рассортировать посты по языкам в разные RSS. (постов очень много, пускай 1000) Вопрос к аудитории - как вы решили бы такую задачу? Чтобы решить подобную задачу можно воспользоваться библиотекой langid.py . Это небольшой инструмент, который без доступа в Интернет(!!!) может определить язык текста (и слова). Инструмент работает и из консоли, и как web сервис, а также как обычный Python-модуль: >>> import langid >>> langid . classify ( \"This is a test\" ) ( 'en' , 0.99999999099035441 ) Ссылка на божественный инструмент: https://github.com/saffsd/langid.py"},{"tags":"Встречи","title":"Анонс встречи №3 сообщества PyNSK","loc":"http://pynsk.ru/posts/2015/Sep/29/anons-vstrechi-3-soobshchestva-pynsk/","text":"Встреча сообщества PyNSK состоится 11 октября (воскресенье) в 13 часов, в Самоваре ( http://go.2gis.com/b20p ) Регистрация на встречу по ссылке - http://bit.ly/pynsk3_reg На встрече вас ожидает море общения и два доклада: Юра Бабуров aka buriy расскажет доклад \"Получаем текст веб-страниц из Python и как это работает\" Описание: Мы рассмотрим python-библиотеку под названием readability-lxml ( https://github.com/buriy/python-readability ) , её применение и механизм работы для задачи извлечения текстов новостных страниц. Евгений Петренко ( https://vk.com/mrevgenx ) погрузит нас в тему тяжелых вычислений на Python с помощью доклада \"Python + GPGPU: ожидания и реалии\" Описание: В докладе расскажу, как добиться дополнительного ускорения сложных вычислений. Будут разобраны подводные камни многопоточности в CUDA, перечислены особенности оптимизиции программ для графического процессора и представлены полезные средства отладки и профилирования. Дополнительно приведу примеры из собственного опыта распараллеливания и оптимизации такого рода программ."},{"tags":"Синтаксис Python","title":"Синтаксис Python: frozenset - морозное множество","loc":"http://pynsk.ru/posts/2015/Sep/28/sintaksis-python-frozenset-moroznoe-mnozhestvo/","text":"frozenset и set, это как кортеж ( tuple ) и список. Первые являются неизменяемыми, вторые изменяемые. Иммутабельные(неизменяемые) структуры данных - это коллекции, которые нельзя изменить. Примерно как числа. Число просто есть, его нельзя поменять. Также и иммутабельный массив — он такой, каким его создали, и всегда таким будет. Если нужно добавить элемент — придется создать новый массив. Преимущества неизменяемых структур: Безопасно разделять ссылку между потоками Легко тестировать Легко отследить жизненный цикл (соответствует data flow) На примере frozenset неизменяемость выглядит так: >>> a = set ( 'qwerty' ) >>> b = frozenset ( 'qwerty' ) >>> a == b True >>> type ( a - b ) < class ' set '> >>> type ( a | b ) < class ' set '> >>> a . add ( 1 ) >>> b . add ( 1 ) Traceback ( most recent call last ): File \"<stdin>\" , line 1 , in < module > AttributeError : 'frozenset' object has no attribute 'add'"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: мета-классы, что это и зачем","loc":"http://pynsk.ru/posts/2015/Sep/26/tainstvo-standartnoi-biblioteki-meta-klassy-chto-eto-i-zachem/","text":"В Python все является объектом. Даже класс. Не объект класса, а сам класс. >>> () . __class__ < type 'tuple' > >>> () . __class__ . __class__ < type 'type' > Если из класса (считай \"шаблон\") мы создает объекты (\"по шаблону делаем экземпляры\"), то что делать как назвать ситуацию, когда кто-то делает классы? Стоит сказать зачем это может быть нужно: изменять типы создаваемых классов. Например, подмешивать миксины(примиси) автоматически вызывать некоторый код каждый раз, когда где-то создается класс, дочерний от данного. Например, дергать метод, который будет логгировать время запуска функции изменять параметры создаваемого дочернего класса. Например, на все функции класса повесить декоратор. (какую-то валидацию) для написания ORM Это все позволяют реализовать мета-классы. Ссылки для чтения: http://hlabs.org/development/python/pro_python.html http://www.ibm.com/developerworks/ru/library/l-pymeta/ http://habrahabr.ru/post/145835/ http://habrahabr.ru/post/65625/ http://www.iso.ru/print/rus/document5953.phtml http://blog.jetfix.ru/post/metaklassy-razrushenie-mifov"},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: основы декларативной магии","loc":"http://pynsk.ru/posts/2015/Sep/25/opyt-razrabotchikov-osnovy-deklarativnoi-magii/","text":""},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: соглашения о кодировании","loc":"http://pynsk.ru/posts/2015/Sep/25/opyt-razrabotchikov-soglasheniia-o-kodirovanii/","text":"В обществе существуют различные соглашения. Соглашения рождаются не просто так, а для того чтобы о чем-то условится и начать создавать. Для разработчика важным является соглашение о кодировании. Это своего рода свод \"законов\", которые принимает новый разработчик, когда погружается в проект. Чаще всего такие законы очевидны и естественны. Возьмем пример - длина строки не более 79 символов. В свое время дисплеи содержали лишь 80 столбцов, поэтому было удобно, когда код помещался на экран. Подобные рекомендации или \"законы\" присущи любому популярному языку. Приглашаю с ними ознакомится по ссылке https://github.com/SalGnt/cscs P.S. PEP8"},{"tags":"Синтаксис Python","title":"Синтаксис Python: dir()","loc":"http://pynsk.ru/posts/2015/Sep/24/sintaksis-python-dir/","text":"Достался нам в наследство какой-то код. А там непонятный объект с названием super_object_1 . Как понять что это за объект? На помощь приходят встроенные функции - type() , dir() . Если с type() все ясно - возвращает тип, то с dir не совсем. dir - Возвращает имена переменных, доступные в локальной области, либо атрибуты указанного объекта в алфавитном порядке. Это значит, что при вызове кода: dir ( super_object_1 ) # мы получим список его методов. Но есть тонкости: Определение в классе метода __dir__() , возвращающего список и имён, позволяет варьировать результат выполнения dir() для экземпляров класса. Для объектов, класс которых не определил __dir__() , функция попытается определить атрибуты по данным __dict__ . Возвращаемый список может включать не все атрибуты, особенно в случаях с переопределенным __getattr__() ."},{"tags":"Функциональный Python","title":"Функциональный Python: fn.py","loc":"http://pynsk.ru/posts/2015/Sep/23/funktsionalnyi-python-fnpy/","text":"Функциональные аспекты, такие как чистота, иммутабельные данные весьма жизнеспособны. Какие-то из них Python хорошо поддерживает, какие-то нет (например, рекурсия). Сегодня хочется упомянуть библиотеку fn.py. Эта библиотека добавляет синтаксический сахар в виде scala-лямбд, персистентных структур данных, стримом, а также другие элементы, которые встречаются в ФП. Рассказ о библиотеке: Исходники библиотеки: https://github.com/kachayev/fn.py"},{"tags":"Извлечение информации","title":"Извлечение информации: grab - фреймворк для веб-парсинга","loc":"http://pynsk.ru/posts/2015/Sep/23/izvlechenie-informatsii-grab-freimvork-dlia-veb-parsinga/","text":"Grab — python библиотека для парсинга сайтов Её основные функции: Подготовка сетевого запроса (cookies, http-заголовки, POST/GET данные) Запрос на сервер (возможно через HTTP/SOCKS прокси) Получение ответа сервера и его первоначальная обработка (парсинг заголовков, парсинг cookies, определение кодировки документа, обработка редиректа (поддерживаются даже редирект в meta refresh тэге)) Работа с DOM-деревом ответа (если это HTML-документ) Работа с формами (заполнение, автозаполнение) Отладка: логирование процесса в консоль, сетевых запросов и ответов в файлы В чем же особенность? Если scrapy — это реально паук, бегает по сети, тянет в тыщу потоков информацию, то grab — это скорее швейцарский нож, вы его берёте и начинает вдумчиво колупать сайт. Пощупать модуль: http://grablib.org/ru/"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: Selenium как инструмент тестирования","loc":"http://pynsk.ru/posts/2015/Sep/22/testy-testy-testy-selenium-kak-instrument-testirovaniia/","text":"Selenium – это проект, в рамках которого разрабатывается серия программных продуктов с открытым исходным кодом. Среди продуктов интересен Selenium WebDriver - это программная библиотека для управления браузерами. WebDriver представляет собой драйверы для различных браузеров и клиентские библиотеки на разных языках программирования, предназначенные для управления этими драйверами. Много слов и мало сути. А суть проста - использование такого веб-драйвера сводится к созданию бота, выполняющего всю ручную работу с браузером автоматизированно. Что может быть автоматизировано? По факту что угодно, что человек может делать вручную. Если вы пишите web проект с UI, то можете написать тесты, которые будут прокликивать все элементы UI на предмет ошибок. Материалы для погружения: http://www.seleniumhq.org/ http://habrahabr.ru/post/152653/ http://habrahabr.ru/post/248559/"},{"tags":"Синтаксис Python","title":"Синтаксис Python: yield from","loc":"http://pynsk.ru/posts/2015/Sep/21/sintaksis-python-yield-from/","text":"Рассмотрим еще одну страшную конструкцию в Python 3.3+ - yield from Напомню, генератор это объект который можно про итерировать только однажды. Записывается как: f = ( x for x in xrange ( 100 )) # Или так def gen (): for x in range ( 100 ): yield x Когда у нас один генератор - все хорошо. Используем его как итератор и радуемся. Но не редки ситуации когда есть два генератора: def generator2 (): for i in range ( 10 ): yield i def generator3 (): for j in range ( 10 , 20 ): yield j И стоит задача - проитерировать один генератор, потом второй. Но вернуть значения не в виде списка, в виде генератора. Здесь на помощь приходит конструкция yield from <expr> где <expr> - выражение, вычисление которого даёт нам итерируемый объект, из которого и вычленяется итератор. Эту конструкцию можно читать так: yield (вернуть значение) <стоп мыслей> from (взять значение из) <expr> Используя yield form задача решается так: def generator(): yield from generator2() yield from generator3() >>> generator() <generator object generator at 0x7f60d8fb3480> Почитать: https://www.python.org/dev/peps/pep-0380/ http://simeonvisser.com/posts/python-3-using-yield-from-in-generators-part-1.html http://habrahabr.ru/post/132554/"},{"tags":"Синтаксис Python","title":"Синтаксис Python: encode/decode","loc":"http://pynsk.ru/posts/2015/Sep/21/sintaksis-python-encodedecode/","text":"Вероятно, самым заметным отличием Python 2 от Python 3 является юникод. Это нововведение упростило работу со строками. Однако, так как Python 2 еще в строю, то кодировки еще в силе и не мало разработчиков путается между encode и decode. Стоит привести картинку, которая прояснит все: Таким образом, если у нас есть строка: a = 'Cool page' То существует множество способов (кодировок) представить ее в байтовом виде Поэтому мы и пишем: a . encode ( '<название кодировки>' ) # переводим строку байтовый вид И обратно. Если у нас есть набор байт, то чтобы получить строку пишем: b '<байт-строка>' . decode ( '<название кодировки>' ) # получаем из байтовой строки настоящую строку Подробнее: http://habrahabr.ru/post/135913/ http://eli.thegreenplace.net/2012/01/30/the-bytesstr-dichotomy-in-python-3/"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: модуль operator","loc":"http://pynsk.ru/posts/2015/Sep/20/tainstvo-standartnoi-biblioteki-modul-operator/","text":"Таинство стандартной библиотеки: модуль operator Модуль operator содержит набор функций, соответствующих операторам Python. Вот некоторые функции: operator . add ( a , b ) # суммирует два значения operator . ne ( a , b ) # то же, что и a!=b operator . attrgetter ( 'id' ) # возвращает ссылку, по которой можно получить атрибут \"id\" Казалось бы, зачем нужны они? А ответ довольно прост - функциональное программирование с использованием итераторов иногда требует создания небольших функций для простых выражений. Иногда они могут быть выражены как лямбда-функции, но некоторые операции не обязательно реализовывать самостоятельно: Код для Python 2: >>> import operator >>> a = [ 2 , 3 , 4 , 5 ] >>> reduce ( lambda x , y : x + y , a ) 14 >>> reduce ( operator . add , a ) 14 Ссылки для изучения: https://pymotw.com/2/operator/ https://docs.python.org/3.5/library/operator.html"},{"tags":"Функциональный Python","title":"Функциональный Python: Python — это не Haskell","loc":"http://pynsk.ru/posts/2015/Sep/19/funktsionalnyi-python-python-eto-ne-haskell/","text":"Идеи функционального программирования довольно популярны, в том числе и в среде программистов на Python, который не является функциональным языком. В докладе речь пойдёт об особенностях функционального стиля в Python, об его отличиях от типичных функциональных языков типа Haskell."},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: слабые ссылки - weakref","loc":"http://pynsk.ru/posts/2015/Sep/19/tainstvo-standartnoi-biblioteki-slabye-ssylki-weakref/","text":"Python имеет автоматическое управление памятью: подсчёт ссылок для большинства объектов и сборка мусора для удаления циклов. Память освобождается сразу после того, как была удалена последняя ссылка на объект. Этот подход отлично работает для большинства приложений, но иногда возникает необходимость вести учёт объектов только когда они используются где-нибудь ещё. К сожалению, само слежение за объектами уже создает ссылку и тем самым объекты остаются в памяти. Модуль weakref (от англ. weak reference - слабая ссылка) даёт средство для учёта объектов без создания ссылок на них. Когда объект больше не нужен, он автоматически удаляется из таблицы слабых ссылок и производится обратный вызов weakref-объектов. Типичное применение модуля - кэширование объектов, которые затратно воспроизвести снова. >>> import weakref , gc >>> class A : ... def __init__ ( self , value ): ... self . value = value ... def __repr__ ( self ): ... return str ( self . value ) ... >>> a = A ( 10 ) # создаёт ссылку >>> d = weakref . WeakValueDictionary () # словарь, использующий слабые ссылки >>> d [ 'primary' ] = a # не создаёт ссылки >>> d [ 'primary' ] # достать объект, если он все ещё \"жив\" 10 >>> del a # удалить одну ссылку >>> gc . collect () # произвести сборку мусора 0 >>> d [ 'primary' ] # запись была автоматически удалена Traceback ( most recent call last ): File \"<stdin>\" , line 1 , in < module > d [ 'primary' ] File \"C:/python31/lib/weakref.py\" , line 46 , in __getitem__ o = self . data [ key ]() KeyError : 'primary' Ссылки на тему: https://docs.python.org/3/library/weakref.html http://pep8.ru/doc/tutorial-3.1/11.html http://www.ilnurgi1.ru/docs/python/modules/weakref.html"},{"tags":"Внутренности Python","title":"Внутренности Python: импорт в Питоне","loc":"http://pynsk.ru/posts/2015/Sep/17/vnutrennosti-python-import-v-pitone/","text":"Любая программа использует импорт модулей. Но, как показал беглый опрос, далеко не все программисты представляют, как работает импорт, что содержится в модуле и как этот импорт можно расширять для своих нужд. Удивительный факт: даже англоязычные ресурсы предоставляют недостаточно информации Серия статей: http://asvetlov.blogspot.ru/2010/05/blog-post.html http://asvetlov.blogspot.ru/2010/05/2.html http://asvetlov.blogspot.ru/2010/05/3.html"},{"tags":"Полезные библиотеки","title":"Полезные библиотеки: gensim - библиотека для моделирования над текстами","loc":"http://pynsk.ru/posts/2015/Sep/17/poleznye-biblioteki-gensim-biblioteka-dlia-modelirovaniia-nad-tekstami/","text":"Gensim - библиотека Python для моделирования, тематическое моделирование документов и извлечения подобия с больших корпусов. Целевая аудитория является обработка естественного языка (НЛП) и IR сообщество. В Gensim реализованы популярные алгоритмы НЛП. Например, word2vec. Большинство реализаций алгоритмов умеет использовать несколько ядер. https://github.com/piskvorky/gensim/"},{"tags":"Пишем web-проекты","title":"Пишем web-проекты: Django Admin Actions","loc":"http://pynsk.ru/posts/2015/Sep/16/pishem-web-proekty-django-admin-actions/","text":"Интерфейс администратора Django достается разработчику \"даром\" - прописываешь немного срочек и готово. Появляется UI где можно изменять объекты моделей - просто так нам предоставляют GRUD возможности. Но что если нам надо сделать какие-то дополнительные возможности? Для примера такие действия есть в Python Дайджест: Такие возможности реализуются с помощью Django admin actions. Для примера так: class ItemModeratorAdmin ( admin . ModelAdmin ): actions = [ '_action_make_moderated' , ] def _action_set_queue ( self , request , queryset ): queryset . update ( status = 'queue' ) _action_set_queue . short_description = 'В очередь' Можно заметить, что добавлена функция, которая принимает request и queryset. queryset - в данном случае это набор выделенных объектов (у тех что галочки стоят). Подробная информация по ссылке: https://docs.djangoproject.com/en/1.8/ref/contrib/admin/actions/"},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: Работа с ошибками. Как ловить исключения и что потом с ними делать","loc":"http://pynsk.ru/posts/2015/Sep/15/opyt-razrabotchikov-rabota-s-oshibkami-kak-lovit-iskliucheniia-i-chto-potom-s-nimi-delat/","text":""},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: assert как средство для валидации","loc":"http://pynsk.ru/posts/2015/Sep/15/opyt-razrabotchikov-assert-kak-sredstvo-dlia-validatsii/","text":"Опыт разработчиков: assert как средство для валидации Хочется сегодня осветить такой элемент синтаксиса как assert. assert - это специальная конструкция, позволяющая проверять предположения о значениях произвольных данных в произвольном месте программы. Какая же польза от этой проверки? Представим что мы что-то пишем код, который получает данные из Базы Данных, производит обработку данных и загружает результат обратно. По замыслу этого кода мы должны положить в базу столько же данных сколько и получили. Но так как мы написали код с ошибками (случайно), то количество данных не совпадает. И что же случится? В этом случае очень хорошо себя показывает assert. Эта конструкция проверят данные и в случае не соответствия ожиданиям - бросает AssertException. Примеры кода: assert 'command' in data , 'Not found command' assert data . get ( 'command' ) == command , 'Not valid command'"},{"tags":"Синтаксис Python","title":"Синтаксис Python: работа с матрицами","loc":"http://pynsk.ru/posts/2015/Sep/14/sintaksis-python-rabota-s-matritsami/","text":"Матрица - это, если утрировать, \"табличка\", N-мерный массив (чаще всего двумерный). Матрицы возникают не редко. Например, игровое поле, карта мира - тоже можно представить матрицей, да то же решето Эратосфена - тоже двумерный массив, или вообще - вложенные списки. Это все создает необходимость знать как работать с матрицами и какими инструментами. Модулей для работы с этими объектами не мало, самые известные - стандартный math и numpy. В Python 3.5 появился новый оператор - @ Этот оператор позволяет перемножать матрицы: a @ b Подробно о операторе: https://www.python.org/dev/peps/pep-0465/"},{"tags":"Учебные материалы","title":"Учебные материалы: книга \"Программируем коллективный разум\"","loc":"http://pynsk.ru/posts/2015/Sep/14/uchebnye-materialy-kniga-programmiruem-kollektivnyi-razum/","text":"Учебные материалы: книга \"Программируем коллективный разум\" Книга \"Программируем коллективный разум\" - это введение в мир машинного обучения и статистики. В ней объясняется, как делать полезные с точки зрения маркетинга выводы о поведении и предпочтениях пользователей на основе информации, ежедневно собираемой вашими и сторонними приложениями. Каждый алгоритм описан четко и кратко и сопровождается кодом, который можно сразу же включить в собственный сайт, блог, Вики или какое-нибудь специализированное приложение. Прелесть этой книги в том, что все примеры на Python. Конечно, код там не фонтан - но он есть."},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: textwrap для сокращения текста","loc":"http://pynsk.ru/posts/2015/Sep/13/tainstvo-standartnoi-biblioteki-textwrap-dlia-sokrashcheniia-teksta/","text":"Таинство стандартной библиотеки: textwrap для укорочения текстов При работе над Python Дайджестом - http://pythondigest.ru/ а именно при работе над \"Колонкой автора\" возникла такая задачка - уменьшить длину описания. Описание ссылок берется из RSS этой группы и оно иногда длинное. Как же наиболее просто решить эту задачу? Самое простое - взять строку описания и взять, скажем первые 300 символов. Просто? Только вот проблема - слово может оборваться на середине. Чтобы не обрабатывать эту ситуацию самостоятельно, можно воспользоваться модулем textwrap. textwrap это стандартный модуль, который позволяет всячески укорачивать текст. Например, можно ограничить длину строки (будет текст выводится в несколько строк). Озвученную задачу можно решить так: import textwrap content = textwrap . shorten ( raw_content , width = 300 ) Ссылки на тему: http://www.dotnetperls.com/textwrap https://docs.python.org/3.5/library/textwrap.html https://pymotw.com/2/textwrap/"},{"tags":"Синтаксис Python","title":"Синтаксис Python: super() это супер","loc":"http://pynsk.ru/posts/2015/Sep/11/sintaksis-python-super-eto-super/","text":"Вы знаете что такое super()? Думаете что это вызов метода класса родителя? Если так, то вам стоит посмотреть это видео."},{"tags":"Hardcore Python","title":"Hardcore Python: Конкурентность в Питоне с нуля. Вживую","loc":"http://pynsk.ru/posts/2015/Sep/10/hardcore-python-konkurentnost-v-pitone-s-nulia-vzhivuiu/","text":""},{"tags":"Полезные библиотеки","title":"Полезные библиотеки: funcy - набор конструкций, которые упрощают код","loc":"http://pynsk.ru/posts/2015/Sep/09/poleznye-biblioteki-funcy-nabor-konstruktsii-kotorye-uproshchaiut-kod/","text":"Полезные библиотеки: funcy - набор конструкций, которые упрощают код Есть ряд модулей, которые стоит ставить первыми. Этот набор у каждого свой. В моем наборе есть место для funcy. funcy - это набор мелких полезностей при работе с данными. Например, можно создать бесконечный список, объединить список списков, объединение словарей, можно превращать вложенные структуры в плоские и наоборот. Это не весь список возможностей - а он и вправду огромный. Посмотрите хотя бы README - https://github.com/Suor/funcy http://habrahabr.ru/post/174619/ P.S. funcy - написана разработчиком из Красноярска"},{"tags":"Извлечение информации","title":"Извлечение информации: скачиваем список ссылок с помощью asyncio","loc":"http://pynsk.ru/posts/2015/Sep/09/izvlechenie-informatsii-skachivaem-spisok-ssylok-s-pomoshchiu-asyncio/","text":"Порой возникают рутинные задачи, которые не хочется делать руками. Примером такой задачи может являться - скачать множество страниц по ссылкам. Если 5 ссылок еще вручную сохранить можно, а если их 1000? или 6250, как было в моем случае. На Python эту задачу можно с помощью модуля asyncio и aiohttp. Вот такой код можно написать за пару минут: import asyncio import aiohttp @asyncio.coroutine def download ( url ): try : response = yield from aiohttp . request ( 'GET' , url ) data = yield from response . text () yield from save_page ( url , data ) # сохраняем страницу в файл, или еще куда except Exception as e : return None @asyncio.coroutine def download_parallel ( urls ): tasks = [ asyncio . Task ( download ( url )) for url in urls ] yield from asyncio . gather ( * tasks ) urls = [ < список ссылок > ] # список ссылок loop = asyncio . get_event_loop () loop . run_until_complete ( download_parallel ( urls ))"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: coverage - узнаем сколько процентов кода покрыто тестами","loc":"http://pynsk.ru/posts/2015/Sep/08/testy-testy-testy-coverage-uznaem-skolko-protsentov-koda-pokryto-testami/","text":"Тесты тесты тесты: coverage - узнаем сколько процентов кода покрыто тестами Юнит-тесты хороши, когда покрывают весь ключевой код. Однако если проект чуть больше, чем \"Hello, world!\", то оценить степень покрытия весьма проблематично. Существуют инструменты, которые помогают это делать. Например - coverage.py - модуль Неда Бачелдера. coverage.py - написан на основе стандартной библлиотеки, может использоваться как из командной строки, так и из кода (как библиотека). Плюс к этому, он может выдавать как суммарный результат (в процентах), так и анотированный (т.е. копия исходного файла, в котором протестированная строка помечается >, не протестированная - !). https://github.com/nedbat/coveragepy"},{"tags":"Синтаксис Python","title":"Синтаксис Python: генераторы","loc":"http://pynsk.ru/posts/2015/Sep/07/sintaksis-python-generatory/","text":"Генераторы это итерируемые объекты, которые можно прочитать лишь один раз. Это связано с тем, что они не хранят значения в памяти, а генерируют их на лету: >>> mygenerator = (x*x for x in range(3)) >>> for i in mygenerator : ... print(i) 0 1 4 Казалось бы, всего один раз можно пройти по данным. Зачем это? На практике мы редко проходим по одним и тем же данным несколько раз. При этом нам не всегда нужны все данные. Например, стоит задача проверить что все элементы массива положительные. Вот мы пишем цикл, в котором сравниваем элементы с нулем. И бац, попадается отрицательный элемент. Можем уже дальше не проверять и уже кинуть ошибку. При этом весь массив не находится в памяти. Это если обычные числа, а если элементы коллекции это результаты вычисления функции - вот как в коде выше, это квадраты. А элементов у нас не 3, а 1 миллион. А в данный момент нам нужны только первые 500, по ним определим нужны ли нам остальные. Вот здесь и приходят на помощь генераторы - они возвращают именно столько сколько и надо данных."},{"tags":"Учебные материалы","title":"Учебные материалы: Python. Подробный справочник","loc":"http://pynsk.ru/posts/2015/Sep/07/uchebnye-materialy-python-podrobnyi-spravochnik/","text":"Не так редко спрашивают \"Какую книжку почитать\". Ответить на такой вопрос не просто, ибо зависит от человека. Однако, есть и универсальные книги - справочники. Сегодня хочу представить аннотацию к книге - Python. Подробный справочник от Дэвида Бизли. «Python. Подробный справочник» — это авторитетное руководство и детальный путеводитель по языку программирования Python. Книга предназначена для практикующих программистов; она нацелена на суть дела и написана очень доступным языком. Она детально описывает не только ядро языка, но и наиболее важные части стандартной библиотеки Python. Дополнительно освещается ряд тем, которые не рассматриваются ни в официальной документации, ни в каких-либо других источниках. Читателю предлагается практическое знакомство с особенностями Python, включая генераторы, сопрограммы, замыкания, метаклассы и декораторы. Подробно описаны новые модули, имеющие отношение к разработке многозадачных программ, использующих потоки управления и дочерние процессы, а также предназначенные для работы с системными службами и организации сетевых взаимодействий."},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: itertools","loc":"http://pynsk.ru/posts/2015/Sep/06/tainstvo-standartnoi-biblioteki-itertools/","text":"Еще один стандартный модуль в Python - itertools. Модуль itertools - сборник полезных итераторов. В нем содержатся множество операций над итераторами, да и сами интераторы. Например есть бесконечная арифметическая прогрессия, можно объединять, разъединять итераторы, всячески извлекать значения как из одного так и групп итераторов, повторять итератор, группировать значения итератора и многое другое. А что именно - по ссылкам. Ссылки по теме: https://docs.python.org/3.5/library/itertools.html https://pymotw.com/2/itertools/ http://pythonworld.ru/moduli/modul-itertools.html"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: docstring","loc":"http://pynsk.ru/posts/2015/Sep/06/tainstvo-standartnoi-biblioteki-docstring/","text":"Docstring - (сокращение от documentation string, строка документации) встроенное средство документирования модулей, функций, классов и методов. Делается очень просто - сразу после определения указывается строковое значение, которое и будет docstring'ом. >>> def test (): ... \"This is the test's docstring\" ... print \"opa\" Получить доступ к docstring можно так: >>> test . __doc__ \"This is the test's docstring\" Либо так: >>> help ( test ) Help on function test in module __main__ : test () This is the test 's docstring Существуют инструменты, которые позволяют извлекать docstring не по одиночке, а для целого модуля/пакета. О них и пойдет речь. Изучаем дальше: https://www.python.org/dev/peps/pep-0257/ http://pyobject.ru/blog/2006/09/08/document-it/ http://habrahabr.ru/post/149371/"},{"tags":"Полезные модули","title":"Полезные модули: PySide","loc":"http://pynsk.ru/posts/2015/Sep/05/poleznye-moduli-pyside/","text":"PySide — привязка языка Python к инструментарию Qt, совместимая на уровне API с PyQt. В отличие от PyQt, PySide доступна для свободного использования как в открытых, так и закрытых, в частности, коммерческих проектах, поскольку лицензирована по LGPL. Проект возник в результате нежелания создателей PyQt менять лицензионную политику для своего проекта. Свет PySide увидел в августе 2009 года, когда была выпущена первая публичная версия. Основными разработчиками PySide являются программисты Digia."},{"tags":"Полезные модули","title":"Полезные модули: PyQt","loc":"http://pynsk.ru/posts/2015/Sep/05/poleznye-moduli-pyqt/","text":"Проекты все чаще зарождаются именно в web, однако, и десктоп ПО еще живо, да и инструментарий к нему. В частности, кроссплатформенный фреймворк Qt имеет обертку для Python - PyQt. Уже давно все крупные GUI-фреймворки имеют дизайнер форм (в нашем случае - Qt designer). В которой вы можете набросать мышкой кнопки на формы, а уже затем в коде добавить логику работы с ними. Соединение логики и GUI в PyQt можно делать двумя способами - .ui файл (такой файл выдает дизайнер форм) конвертировать в py файл и отнаследоваться от класса. Понятно, что если идет активная разработка GUI, то придется множество раз конвертировать, что лень. Поэтому есть более простое решение - напрямую подключать .ui файл. Для этого есть методы loadUi и loadUiType"},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: файл requirements.txt в каждый проект","loc":"http://pynsk.ru/posts/2015/Sep/04/opyt-razrabotchikov-fail-requirementstxt-v-kazhdyi-proekt/","text":"Первой проблемой при поддержке старых проектов является понять, как запустить его. Чтобы немного упростить эту задачу разработчики используют pip и файл requirements.txt. В этом файле записываются все необходимые для работы библиотеки и, что самое главное, указывают версии этих библиотек. Имея такой файл настройка окружения для старта проекта может состоять из одной команды: pip install -r requirements.txt"},{"tags":"Пишем web-проекты","title":"Пишем web-проекты: выжимаем максимум из PostgreSQL","loc":"http://pynsk.ru/posts/2015/Sep/03/pishem-web-proekty-vyzhimaem-maksimum-iz-postgresql/","text":"Postgres предоставляет много встроенных возможностей для создания эфективных приложений, использующих базы данных. А в версии 9.4 появляется еще и полноценное JSON поле, при правильном использовании которого, отпадает необходимость использвания NoSQL баз данных. В докладе мы рассмотрим, как использовать этот потенциал по максимуму в своих Python/Django приложениях."},{"tags":"Полезные инструменты","title":"Полезные инструменты: django-debug-toolbar","loc":"http://pynsk.ru/posts/2015/Sep/02/poleznye-instrumenty-django-debug-toolbar/","text":"Разработка программ сопряжена с сложностями. Произвольно или нет лезут различные баги. Для поиска ошибок применяют различные инструменты, например дебаг. Дебаг бывает кустарным - print'ами, а есть более каноничный подход - дебаггерами. С десктоп программами все ясно - сиди тыкай точки остановки и изучай состояние программы, а что делать с web? А делать вот что - ставить debug toolbar: https://github.com/django-debug-toolbar/django-debug-toolbar Именно этот для Django, но такие есть и для других фреймворков."},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: doctest","loc":"http://pynsk.ru/posts/2015/Sep/01/testy-testy-testy-doctest/","text":"Тесты можно писать прям в коде, а точнее в docstring. Модуль doctest ищет куски текста, которые выглядят как интерактивные сессии Python и затем выполняет эти сессии, чтобы проверить, что они работают точно так же, как показано. Есть несколько стандартных причин, чтобы использовать doctest: Для того, чтобы проверить актуальность строк документации, убедившись, что все интерактивные примеры работают именно так, как задокументировано. Чтобы организовать регрессионное тестирование, проверяя, что интерактивные примеры из тестового файла или тестового объекта работают как ожидается. Чтобы написать руководство для пакета, иллюстрированное примерами ввода-вывода. В зависимости от того, на что обращается внимание - на примеры или на пояснительный текст, это можно назвать либо \"литературным тестированием\", либо \"исполняемой документацией\". Существует отличная статья про doctest - http://python-lab.ru/documentation/27/stdlib/doctest.html , поэтому здесь повторяться не буду."},{"tags":"Синтаксис Python","title":"Синтаксис Python: множества (set)","loc":"http://pynsk.ru/posts/2015/Aug/31/sintaksis-python-mnozhestva-set/","text":"Множество в python - \"контейнер\", содержащий не повторяющиеся элементы в случайном порядке. >>> a = set () >>> a set () >>> a = set ( 'hello' ) >>> a { 'h' , 'o' , 'l' , 'e' } >>> a = { 'a' , 'b' , 'c' , 'd' } >>> a { 'b' , 'c' , 'a' , 'd' } >>> a = { i ** 2 for i in range ( 10 )} # генератор множеств >>> a { 0 , 1 , 4 , 81 , 64 , 9 , 16 , 49 , 25 , 36 } >>> a = {} # А так нельзя! >>> type ( a ) < class ' dict '> Ссылки по теме: http://pythonworld.ru/tipy-dannyx-v-python/mnozhestva-set-i-frozenset.html http://server.179.ru/tasks/python/2014b1/17-sets.html http://informatics.mccme.ru/mod/book/view.php?id=6693"},{"tags":"Синтаксис Python","title":"Синтаксис Python: оператор yield","loc":"http://pynsk.ru/posts/2015/Aug/31/sintaksis-python-operator-yield/","text":"При чтении чужого кода можно столкнутся с многими непонятными конструкциями. А сейчас хочу коротко осветить такую конструкцию как yield. Yield - это ключевое слово которое используется так же, как и слово return. Разница в том, что функция при этом начинает возвращать генератор вместо значения. def generator (): for i in ( 1 , 2 , 3 ): yield i g = generator () print ( g ) < generator object generator at 0x2e58870 > for i in g : print ( i ) 1 2 3 В данном случае, с практической точки зрения, это бесполезный пример. Ощутимую пользу вы получите в ситуации, когда ваша функция должна будет возвращать достаточно большой объём данных, но использовать их надо будет только один раз. Для того чтобы до конца освоить оператор yield, вы должны знать, что когда вы вызываете функцию, в теле которой находится yield, выполнение этой функции не происходит. Вместо выполнения, функция вернёт объект-генератор. Выглядит это несколько странно на первый взгляд - функция вызвана, но код не выполнен, но, просто запомните этот факт. Код будет выполнятся при каждой итерации - будь то цикл \"for <...> in \" или вызов метода .next(). Ссылки по теме: http://zetblog.ru/programming/201304/python-iterators-generators-yield/ http://habrahabr.ru/post/132554/ http://www.ibm.com/developerworks/ru/library/l-pycon/ http://blog.jetfix.ru/post/chto-takoe-yield-i-dlya-chego-eto-slovo-nuzhno"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: abc","loc":"http://pynsk.ru/posts/2015/Aug/30/tainstvo-standartnoi-biblioteki-abc/","text":"Абстрактные базовые классы и интерфейсы — близкие по назначению и смыслу сущности. Как первые, так и вторые представляют собой своеобразный способ документирования кода и помогают ограничить (decouple) взаимодействие отдельных абстракций в программе (классов). Питон — очень гибкий язык. Одна из граней этой гибкости — возможности, предоставляемые метапрограммированием. И хотя в ядре языка абстрактные классы и интерфейсы не представлены, первые были реализованы в стандартном модуле abc, вторые — в проекте Zope (модуль zope.interfaces). Начиная с версии языка 2.6 в стандартную библиотеку включается модуль abc, добавляющий в язык абстрактные базовые классы (далее АБК). АБК позволяют определить класс, указав при этом, какие методы или свойства обязательно переопределить в классах-наследниках http://habrahabr.ru/post/72757/ https://docs.python.org/3/library/abc.html"},{"tags":"Внутренности Python","title":"Внутренности Python: на что уходит память","loc":"http://pynsk.ru/posts/2015/Aug/30/vnutrennosti-python-na-chto-ukhodit-pamiat/","text":"Часто утверждают, что Python жрет очень много памяти. В этом видео вы узнаете как Python работает с памятью"},{"tags":"Полезные инструменты","title":"Полезные инструменты: pycallgraph","loc":"http://pynsk.ru/posts/2015/Aug/29/poleznye-instrumenty-pycallgraph/","text":"Идеальный программист не пишет тесты, потому что у него не бывает ошибок. А сверх идеальный программист даже код не пишет. А так как идеальных нет, поэтому бывают медленные куски программы. Точнее как, обычно это называем \"тормозит\". Чтобы понять какое место тормозит можно воспользоваться модулем pycallgraph - https://github.com/gak/pycallgraph Данный модуль строит красивые графики-графы, в которых цветом выделяет медленные места программы. Очень удобно."},{"tags":"Python на службе народа","title":"Python на службе народа: создаем бота для Telegram","loc":"http://pynsk.ru/posts/2015/Aug/28/python-na-sluzhbe-naroda-sozdaem-bota-dlia-telegram/","text":"Развитие общества обладает цикличностью. Лет 30-25 назад были популярны чаты, лет 15-10 назад тоже чаты были на коне. И сейчас снова. Только теперь это называют словом мессенджер. Хочется привести информацию о создании бота для мессенджера Telegram. 24 июня разработчики Telegram открыли платформу для создания ботов. Прежде всего, бот для Telegram — это по-прежнему приложение, запущенное на вашей стороне и осуществляющее запросы к Telegram Bot API. Причем API довольное простое — бот обращается на определенный URL с параметрами, а Telegram отвечает JSON объектом. http://habrahabr.ru/post/262247/"},{"tags":"Полезные инструменты","title":"Полезные инструменты: IPython","loc":"http://pynsk.ru/posts/2015/Aug/28/poleznye-instrumenty-ipython/","text":"IPython - интерактивная оболочка для языка программирования Python, которая предоставляет расширенную интроспекцию, дополнительный командный синтаксис, подсветку кода и автоматическое дополнение. IPython весьма удобен для демонстраций и экспериментов. В отличие от стандартного REPL, IPython может запоминать введенные команды. А IPython Notebook позволяет сохранить все свои эксперименты в файл, после чего залить на сервис для просмотра другими. Даже github поддерживает отображение этих \"книг\". IPython хорошо себя зарекомендовал из-за расширений. С помощью расширений можно подключать самые различные модули. И что немного \"странно\" - использовать другие языки совместно с Python. Например, вы можете написать часть своего эксперимента на R, а часть на Python - и они будут работать совместно."},{"tags":"Функциональный Python","title":"Функциональный Python: пробуем функциональщину","loc":"http://pynsk.ru/posts/2015/Aug/27/funktsionalnyi-python-probuem-funktsionalshchinu/","text":"Существует два основных подхода в программировании - декларативный и императивный. Каждый из них имеет свои достоинства и недостатки. Крайнее время декларативный подход, а в частности функциональное программирование стало весьма популярным. Давайте ознакомимся с ним:"},{"tags":"Пишем web-проекты","title":"Пишем web-проекты: туториал по django","loc":"http://pynsk.ru/posts/2015/Aug/26/pishem-web-proekty-tutorial-po-django/","text":"Django - это крупный web-фреймворк. Это отличный инструмент для создания web-приложений. Освоение этого инструмента занимает приличное количество времени. А начать можно с туториала - https://docs.djangoproject.com/en/stable/intro/tutorial01/"},{"tags":"Полезные библиотеки","title":"Полезные библиотеки: генерация html с помощью Yattag","loc":"http://pynsk.ru/posts/2015/Aug/26/poleznye-biblioteki-generatsiia-html-s-pomoshchiu-yattag/","text":"В PyPi репозитории не один шаблонизатор HTML. Но далеко не всегда хочется тащить его за собой. В этом случае нам поможет модуль Yattag - это библиотека (DSL по сути), которая позволяет в Python-way формате писать HTML/XML файлы Ознакомьтесь с туториалом: http://www.yattag.org/#tutorial"},{"tags":"Пишем web-проекты","title":"Пишем web-проекты: обзор и сравнение методов реализации REST API в Django","loc":"http://pynsk.ru/posts/2015/Aug/25/pishem-web-proekty-obzor-i-sravnenie-metodov-realizatsii-rest-api-v-django/","text":"Без API уже тяжело представить веб-проект. Для django существует несколько библиотек, которые позволяют создать REST API за пару строк."},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: пишем совместимый код (Python 2 и 3)","loc":"http://pynsk.ru/posts/2015/Aug/25/opyt-razrabotchikov-pishem-sovmestimyi-kod-python-2-i-3/","text":"Python 3 вышел в 2008 году, однако, до сих пор не все перешли на новую версию. Раньше основными аргументами, чтобы не начинать новые проекты на Python были - библиотеки не готовы к использованию, нет особых фич. Первое уже вполне решено - https://python3wos.appspot.com/ А второе, начиная с Python 3.3 уже слабо актуально - много новых фич введено. Поэтому теперь актуально писать совместимый код. Для наиболее легкого написания кода одинаково работающего как в Python 2.6+ так и в Python 3.* рекомендуется использовать библиотеку six. В ней собрано большее количество инструментов позволяющих писать кросверсионный код для Python 2.x-3.x. Для нахождения мест подлежащих изменению рекомендуется воспользоваться утилитами 2to3 или python-modernize. https://pythonhosted.org/six/ http://docs.python.org/2.7/library/2to3.html https://github.com/mitsuhiko/python-modernize"},{"tags":"Синтаксис Python","title":"Синтаксис Python: with ... as","loc":"http://pynsk.ru/posts/2015/Aug/24/sintaksis-python-with-as/","text":"Конструкция with ... as используется для оборачивания выполнения блока инструкций менеджером контекста. Иногда это более удобная конструкция, чем try...except...finally . Синтаксис конструкции with ... as : \"with\" expression [ \"as\" target ] ( \",\" expression [ \"as\" target ]) * \":\" suite Теперь по порядку о том, что происходит при выполнении данного блока: Выполняется выражение в конструкции with ... as . Загружается специальный метод __exit__ для дальнейшего использования. Выполняется метод __enter__ . Если конструкция with включает в себя слово as , то возвращаемое методом __enter__ значение записывается в переменную. Выполняется suite. Вызывается метод __exit__ , причём неважно, выполнилось ли suite или произошло исключение. В этот метод передаются параметры исключения, если оно произошло, или во всех аргументах значение None, если исключения не было. Примером использования данной конструкции является чтение и запись из/в файл (гарантированное закрытие файла) http://effbot.org/zone/python-with-statement.htm http://pythonworld.ru/osnovy/with-as-menedzhery-konteksta.html https://docs.python.org/2/reference/compound_stmts.html"},{"tags":"Синтаксис Python","title":"Синтаксис Python: знакомимся с синтаксисом за Y минут","loc":"http://pynsk.ru/posts/2015/Aug/24/sintaksis-python-znakomimsia-s-sintaksisom-za-y-minut/","text":"Когда мне необходимо быстро вникнуть в синтаксис языка X, то использую этот сайт: http://learnxinyminutes.com/docs/ru-ru/python3-ru/ А по ссылке вы найдете синтаксис языка Python"},{"tags":"Hardcore Python","title":"Hardcore Python: запускаем С код с помощью cffi","loc":"http://pynsk.ru/posts/2015/Aug/23/hardcore-python-zapuskaem-s-kod-s-pomoshchiu-cffi/","text":"Самый популярный Python это CPython. Он настолько популярен, что когда говорят Python имеют ввиду именно каноническую реализацию - CPython. CPython, как можно понять из названия, имеет какое-то отношение к языку C. Из Python вы можете с помощью ctypes дергать С-шные функции. Однако, этот механизм несколько медленный и не всегда удобный - бывает надо просто дернуть один кусок C-кода. Или надо только часть от h-файла, или только кусок структуры. Вот в этом случае помогает - cffi. Пример кода с использованием этой библиотеки: >>> from cffi import FFI >>> ffi = FFI () >>> ffi . cdef ( \"\"\" .......int printf(const char *format, ...); // copy-pasted from the man page .......\"\"\" ) >>> C = ffi . dlopen ( None ) # loads the entire C namespace >>> arg = ffi . new ( \"char[]\" , \"world\" ) # equivalent to C code: char arg[] = \"world\"; >>> C . printf ( \"hi there, %s . \\n \" , arg ) # call printf hi there , world . 17 # this is the return value >>> Эти многоточия в cdef это реальный код, который надо писать. https://cffi.readthedocs.org/en/latest/ https://pypi.python.org/pypi/cffi"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки:  functools.singledispatch","loc":"http://pynsk.ru/posts/2015/Aug/23/tainstvo-standartnoi-biblioteki-functoolssingledispatch/","text":"Стандартная поставка Python полна возможностями. Хочется упомянуть обобщенные функции. Если простыми словами, то это такие функции, где мы не думаем о типах аргументов, а просто пишем логику. Например, (натянутый пример) оператор \"+\" - мы не думаем о аргументах, мы просто складывает два объекта. Для реализации обобщенных функций в Python 3 (начиная с 3.4) появился метод singledispatch в модуле functools. Подробней о этом механизме по ссылке - https://www.python.org/dev/peps/pep-0443/"},{"tags":"Полезные библиотеки","title":"Полезные библиотеки: plot.ly (plotly)","loc":"http://pynsk.ru/posts/2015/Aug/22/poleznye-biblioteki-plotly-plotly/","text":"Понятное представление информации - это вечная задача. Причем она свойственна всем. Хочется упомянуть графики. Вот собрали мы данные, задача была не простая, а теперь надо их представить. Графики бывают разных типов, их очень много. Даже если какой-то график сделали, а как поделиться? Можно скинуть картинку, да только придется потом с \"линейкой\" вычислять значения, а можно пойти по другому пути - https://plot.ly/python/. ploy.ly предоставляет возможно создать динамический график, например, https://plot.ly/python/dashboard/ plot.ly позволяет создавать самые разные графики, которые будут выглядеть как живые - можно будет методом тыка узнать значение графика в точке, покрутить, повертеть график."},{"tags":"Полезные библиотеки","title":"Полезные библиотеки: numpy","loc":"http://pynsk.ru/posts/2015/Aug/22/poleznye-biblioteki-numpy/","text":"NumPy — это библиотека языка Python, добавляющая поддержку больших многомерных массивов и матриц, вместе с большой библиотекой высокоуровневых (и очень быстрых) математических функций для операций с этими массивами. В чем же \"фишка\" NumPy вы можете спросить. Основным объектом NumPy является однородный многомерный массив (в numpy называется numpy.ndarray). Это многомерный массив элементов (обычно чисел), одного типа. Здесь можно подчеркнуть одного типа . Эта существенная деталь позволяет заметно ускорить работу с такими объектами. Зная, что данный объект имеет только, скажем, целые числа, то не будут производится проверки типов. Плюс к этому - уменьшается общий объем памяти для хранения таких объектов. http://pythonworld.ru/numpy/1.html http://www.numpy.org/"},{"tags":"Внутренности Python","title":"Внутренности Python: зачем нужен GIL(Global interpreter lock)","loc":"http://pynsk.ru/posts/2015/Aug/21/vnutrennosti-python-zachem-nuzhen-gilglobal-interpreter-lock/","text":"Много хают GIL в Python, в этом видео вы узнаете насколько же он плох... или все-таки хорош? !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"},{"tags":"Python на службе народа","title":"Python на службе народа: распознаем образы с помощью Raspberry Pi","loc":"http://pynsk.ru/posts/2015/Aug/21/python-na-sluzhbe-naroda-raspoznaem-obrazy-s-pomoshchiu-raspberry-pi/","text":"Raspberry Pi - это мини-компьютер, который имеет невысокую цену и при этом имеет богатые возможности. Применение мини-компьютеров широкое, например, можно сделать камеру для дома - можете реализовать программку, которая будет следить за вашим маленьким ребенком и посылать вам сигнал, когда ребенок проснулся. !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"},{"tags":"Интересные концепции","title":"Интересные концепции: Трансдьюсеры","loc":"http://pynsk.ru/posts/2015/Aug/20/interesnye-kontseptsii-transdiusery/","text":"Трансдьюсеры — это попытка переосмыслить операции над коллекциями, найти в них общую идею и принцип, научиться совмещать вместе несколько операций для их дальнейшего переиспользования. !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"},{"tags":"Встречи","title":"Анонс встречи №2 сообщества PyNSK","loc":"http://pynsk.ru/posts/2015/Aug/20/anons-vstrechi-2-soobshchestva-pynsk/","text":"Внимание внимание внимание, в середине сентября, а именно, 13 сентября в 13 часов пройдет встреча Python-сообщества PyNSK. Подробности по ссылке - https://vk.com/pynsk_13_09_2015 На встрече вас ожидает два полноценных доклада и один мини-доклад: Доклад Игоря Старикова (основатель Python сайта http://pythonz.net/ ) - \"Разработчик разработчику: Азбука вежливости\" Доклад Артёма Попова https://vk.com/id42320764 - \"Python в музыке. osc, midi и asyncio\" Мини-доклад Алесандра Сапронова ( https://vk.com/sapronov.alexander ), который расскажет о новостях из мира Python: \"Commit ускоривший Python 2.7.11 на 30% и новое в Python 3.5\""},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: functools.partial","loc":"http://pynsk.ru/posts/2015/Aug/20/tainstvo-standartnoi-biblioteki-functoolspartial/","text":"Представим, написали мы функцию: def super_function ( server_name , host ): .... print ( server_name ) ........... .... run_server ( host ) Но вот беда, первый аргумент - имя сервера у вас уже есть. А второй, ip сервера, вы получите от пользователя, а функцию уже надо вызвать. Можно, конечно, дождаться когда будет два аргумента, тогда и запустить. А можно пойти по другому пути - воспользоваться механизмом каррирования - такое страшное слово. Каррирование - преобразование функции от (предположим) двух аргументов в функцию от первого аргумента, возвращающую функцию, результат вызова которой со вторым агрументом эквивалентен вызову первоначальной функции с упомянутыми аргументами. Мощный механизм, который нам и поможет. Пишем from functools import partial my_func = partial ( super_function , 'My super server' ) .... .... host = '127.0.0.1' my_func ( host ) https://docs.python.org/3.4/library/functools.html"},{"tags":"Полезные инструменты","title":"Полезные инструменты: gunicorn","loc":"http://pynsk.ru/posts/2015/Aug/19/poleznye-instrumenty-gunicorn/","text":"Вот вы написали web-проект, теперь надо его опубликовать на хостинге (или у себя на машине) (задеплоить). Начинаете жадно мучать гугл странными запросами. И вот наконец-то доходите до слов - uwsgi и gunicorn. Это серверы, которые с одной стороны предоставляют пользователям доступ к вашему проекту(сайтику), а с другой - общаются с вашим Python кодом. Стоит сказать, что gunicorn это WSGI HTTP сервер, написанный на питоне и легкий в настройке. Среди заявленных возможностей: поддержка WSGI, Django и Paster async, sync worker балансировка нагрузки через pre-fork и shared socket разные хуки для расширение возможностей Этот инструмент простой для понимания. Рекомендуем его использовать. http://gunicorn.org/"},{"tags":"Извлечение информации","title":"Извлечение информации: парсинг дат/времени","loc":"http://pynsk.ru/posts/2015/Aug/19/izvlechenie-informatsii-parsing-datvremeni/","text":"Извлечение информации из текста/web-страниц сопряжено с эвристиками. Одна из проблем, с которой сталкиваются разработчики - как парсить даты. Даты можно написать 100 и одним способом: tomorrow, а еще 4/4/80 или March 5th, 1980. И какой код писать, чтобы понять эти даты? К счастью, код уже написан - https://github.com/bear/parsedatetime Данная библиотека позволяет спарсить время в самых различных форматах."},{"tags":"Статическая типизация в Python","title":"Статическая типизация в Python: сила опциональной типизации","loc":"http://pynsk.ru/posts/2015/Aug/18/staticheskaia-tipizatsiia-v-python-sila-optsionalnoi-tipizatsii/","text":"Не секрет, что Python (CPython) - динамически типизируемый язык (все типы выясняются во время выполнения программы). Это как дар так и проклятие. С одной стороны - можно быстрее писать программы, с другой - тяжелее найти ошибки. При этом, если была бы статическая типизация - уже на этапе компиляции мы знали бы где мы затупили с типами. В этом видео рассказывается, как же можно использовать опциональную статическую типизацию в Python !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: nose","loc":"http://pynsk.ru/posts/2015/Aug/18/testy-testy-testy-nose/","text":"nose — это инструмент для прогона тестов посредством unittest (и doctest, с ключом --with-doctest). Имеет также собственное API, использовать которое необязательно. nose автоматически собирает тесты из файлов вида test_*, достаточно умен, чтобы заглянуть в папочку tests при наличии таковой, умеет измерять покрытие кода (code coverage) при помощи coverage.py (--with-coverage). Также можно запустить только тесты, которые отвалились в последний прогон (--failed). https://nose.readthedocs.org/en/latest/"},{"tags":"Полезные инструменты","title":"Полезные инструменты: Pycharm","loc":"http://pynsk.ru/posts/2015/Aug/17/poleznye-instrumenty-pycharm/","text":"Pycharm - это IDE специализированная под Python разработку. Возможности этого редактора кода захватывают: - Статический анализ кода, подсветка синтаксиса и ошибок. - Рефакторинг: переименование, извлечение метода, введение переменной, введение константы, подъём и спуск метода и т. д. - Инструменты для веб-разработки с использованием фреймворка Django - Встроенный отладчик для Python - Встроенные инструменты для юнит-тестирования - Поддержка систем контроля версий (Git, svn и другие) - По-мимо этого, Pycharm поддержку множество модулей, например, IPython встроен в редактор. https://www.jetbrains.com/pycharm/"},{"tags":"Синтаксис Python","title":"Синтаксис Python: изменяемые и неизменяемые типы данных","loc":"http://pynsk.ru/posts/2015/Aug/17/sintaksis-python-izmeniaemye-i-neizmeniaemye-tipy-dannykh/","text":"Все типы данных в Python относятся к одной из 2-х категорий: изменяемые (mutable) и неизменяемые (unmutable). Многие из предопределённых типов данных Python — это типы неизменяемых объектов: числовые данные (int, float, complex), символьные строки (class 'str'), кортежи (tuple). Другие типы определены как изменяемые: списки (list), множества (set), словари (dict). Вновь определяемые пользователем типы (классы) могут быть определены как неизменяемые или изменяемые. Изменяемость объектов определённого типа является принципиально важной характеристикой, определяющей, может ли объект такого типа выступать в качестве ключа для словарей (dict) или нет. Подробнее по ссылке - https://www.ibm.com/developerworks/ru/library/l-python_details_02/"},{"tags":"Hardcore Python","title":"Hardcore Python: Cython","loc":"http://pynsk.ru/posts/2015/Aug/16/hardcore-python-cython/","text":"Cython — язык программирования, упрощающий написание модулей С/С++ кода для Python. Кроме стандартного синтаксиса Python, поддерживаются: Прямой вызов функций и методов С/С++ из кода на Cython; Строгая типизация переменных, классов, атрибутов классов. Код Cython преобразуется в С/С++ код для последующей компиляции и впоследствии может использоваться как расширение стандартного Python или как независимое приложение со встроенной библиотекой выполнения Cython. Программирование на Cyhton не очень отличается от Python: cdef ackermann ( int m , int n ): if m == 0 : return n + 1 elif n == 0 : return ackermann ( m - 1 , 1 ) else : return ackermann ( m - 1 , ackermann ( m , n - 1 )) print ( \"Ackermann:\" ) print ( ackermann ( 0 , 3 )) print ( ackermann ( 1 , 4 )) В этом коде указаны типы, что делать не обязательно (тогда и прироста не будет толком) Типы в Cython - Си-шные, т.е. каких-то сложных Python-типов вы не найдете. Хорошее применение языка - связка с C/C++ кодом - оно происходит в разы быстрее, чем в CPython и PyPi. Скорость исполнения программы также выше (может достигать сотен раз). http://cython.org/ https://www.wikiwand.com/ru/Cython"},{"tags":"Полезные библиотеки","title":"Python и асинхронные задачи","loc":"http://pynsk.ru/posts/2015/Aug/16/python-i-asinkhronnye-zadachi/","text":"Celery — распределенная очередь заданий И так, что же умеет Celery: Выполнять задания асинхронно или синхронно Выполнять периодические задания(умная замена crond) Выполнять отложенные задания Распределенное выполнение (может быть запущен на N серверах) В пределах одного worker'а возможно конкурентное выполнение нескольких задач(одновременно) Выполнять задание повторно, если вылез exception Ограничивать количество заданий в единицу времени(rate limit, для задания или глобально) Routing заданий(какому worker'у что делать) Несложно мониторить выполнение заданий Выполнять подзадания Присылать отчеты об exception'ах на email Проверять выполнилось ли задание(удобно для построения Ajax приложений, где юзер ждет факта завершения) Применение очередей задач широкое - если у вас есть задачи, которые можно выполнить не прям сейчас, а чуть позже - то стоит использовать. Примеры таких задач - парсинг RSS, отправка Email. http://www.celeryproject.org/"},{"tags":"Полезные библиотеки","title":"Рисование графиков на Python","loc":"http://pynsk.ru/posts/2015/Aug/15/risovanie-grafikov-na-python/","text":"Графики бывают совсем разные. Де-факто стандартом в питоне для построения графиков является matplotlib. Это такой комбайн, который умеет очень много, даже 3Д графики. Matplotlib написан и поддерживался в основном Джоном Хантером (англ. John Hunter) и распространяется на условиях BSD-подобной лицензии. Генерируемые в различных форматах изображения могут быть использованы в интерактивной графике, в научных публикациях, графическом интерфейсе пользователя, веб-приложениях, где требуется построение диаграмм. http://matplotlib.org/"},{"tags":"Python в играх","title":"Python в играх: PyGame","loc":"http://pynsk.ru/posts/2015/Aug/15/python-v-igrakh-pygame/","text":"Pygame - это кроссплатформенная библиотека языка Python, предназначенная для написания компьютерных игр и мультимедиа приложений. Для знакомства с возможностями PyGame ссылки: http://habrahabr.ru/post/130726/ http://habrahabr.ru/post/130726/ http://habrahabr.ru/post/164229/ http://habrahabr.ru/post/193888/ http://www.pygame.org/"},{"tags":"Python в играх","title":"Python в играх: где используется Python?","loc":"http://pynsk.ru/posts/2015/Aug/14/python-v-igrakh-gde-ispolzuetsia-python/","text":"Сегодня вашему вниманию представляется статья и небольшая инфографика, которая покажет вам на конкретных примерах, что Python столь же эффективен в разработке игр, как и в других областях. http://tproger.ru/articles/python-powered-games/"},{"tags":"Python на службе народа","title":"Python на службе народа: Я выключил духовку?","loc":"http://pynsk.ru/posts/2015/Aug/14/python-na-sluzhbe-naroda-ia-vykliuchil-dukhovku/","text":"Программирование должно упрощать жизнь. Распознавание образов это интересная задача, но далеко не всегда надо обучать нейронную сеть, вычислять на видеокарте. OpenCV это библиотека компьютерного зрения. Которая ОЧЕНЬ много умеет чего. По ссылке вы сможете найти пример использование OpenCV для определения \"Выключил ли я духовку?\" http://kazuar.github.io/light-detection-opencv/"},{"tags":"Hardcore Python","title":"Python оптимизации: сверхоптимизация кода на Python","loc":"http://pynsk.ru/posts/2015/Aug/13/python-optimizatsii-sverkhoptimizatsiia-koda-na-python/","text":""},{"tags":"Опыт разработчиков","title":"Опыт разработчиков: \"Перестаньте писать классы\"","loc":"http://pynsk.ru/posts/2015/Aug/13/opyt-razrabotchikov-perestante-pisat-klassy/","text":"Признак того, что объект не должен быть классом — если в нём всего 2 метода, и один из них — инициализация, __init__ . Каждый раз видя это, подумайте: «наверное, мне нужна просто одна функция». http://habrahabr.ru/post/140581/ http://habrahabr.ru/post/143620/"},{"tags":"Извлечение информации","title":"Парсинг и Python: mechanize","loc":"http://pynsk.ru/posts/2015/Aug/12/parsing-i-python-mechanize/","text":"Для сбора данных с Web-страниц в Python существует библиотека mechanize, автоматизирующая взаимодействие с Web-сайтами. Часто используемая совместно с ней библиотека Beautiful Soup помогает понять тот «почти-HTML» код, который обычно находится на Web-сайтах. http://www.ibm.com/developerworks/ru/library/l-python-mechanize-beautiful-soup/"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: примеры для asyncio - aiohttp","loc":"http://pynsk.ru/posts/2015/Aug/12/tainstvo-standartnoi-biblioteki-primery-dlia-asyncio-aiohttp/","text":"Asyncio - это модуль содержащий инфраструктуру пригодную для написания асинхронных сетевых приложений. Благодаря концепции сопрограмм (coroutines), код асинхронного приложения прост для понимания и поддержки. Экосистема развивается не по дням, а по часам. Стоит обратить внимание на развитие этого направления современного Python http://sysdev.me/python-asyncio/ https://docs.python.org/3/library/asyncio.html https://docs.python.org/3/library/asyncio-dev.html"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: что такое фикстура (fixture)?","loc":"http://pynsk.ru/posts/2015/Aug/11/testy-testy-testy-chto-takoe-fikstura-fixture/","text":"При написании тестов не редка ситуация, когда надо иметь фиксированное воспроизводимое много раз состояние программы. Например, такая-то кнопочка нажата, такой-то класс содержит такие-то значения. Чтобы не приходилось каждый раз вручную создавать подобное состояние программы используются fixture (фикстуры). Фикстуры позволяют сохранить состояние системы в файл, а потом его от туда загрузить. По-мимо тестов, фикстуры применяются для создания начального состояния системы. Например, есть проект, который использует базу данных(БД). И возникает задача развернуть проект на новом компьютере. Можно перетаскивать БД и чистить от лишнего. А можно сохранить первичное состояние в файле и затем его подгрузить. Ссылки для погружения: http://farmdev.com/projects/fixture/ http://pythontesting.net/framework/pytest/pytest-fixtures-easy-example/ https://docs.djangoproject.com/en/1.8/howto/initial-data/"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: пропускаем тесты в pytest по условию","loc":"http://pynsk.ru/posts/2015/Aug/11/testy-testy-testy-propuskaem-testy-v-pytest-po-usloviiu/","text":"Тесты не всегда универсальны. Например, в Windows надо дергать одну программу, в Linux другую. Чтобы реализовать такую логику в pytest можно воспользоваться - skipif import sys @pytest.mark.skipif ( sys . version_info < ( 3 , 3 ), reason = \"requires python3.3\" ) def test_function (): ... Вот такой пример демонстрирует как можно пропустить тест, если запуск происходит в Python версии ниже 3.3."},{"tags":"Разное","title":"Установка библиотек в Python","loc":"http://pynsk.ru/posts/2015/Aug/10/ustanovka-bibliotek-v-python/","text":"Репозиторий pypi содержит более 62к модулей. Такое количество готовых инструментов, в дополнение к богатой стандартной поставке, позволяет заметно упростить разработку новых проектов. Вот только новички сталкиваются с проблемой установки этих самых модулей. Стандартным способом установки новых модулей является pip (и easy_install). pip https://pip.pypa.io/en/latest/index.html это инструмент, который упрощает управление модулями. Вы можете установить модуль, например numpy: pip install numpy Удалить, его же: pip unistall numpy Можете получить список библиотеки уже установленных - pip list Это не весь список команд, но и его достаточно для установки библиотек буквально в 1 команду."},{"tags":"Таинство стандартной библиотеки","title":"Магические методы в Python","loc":"http://pynsk.ru/posts/2015/Aug/10/magicheskie-metody-v-python/","text":"Статья от Rafe Kettler. Что такое магические методы? Они всё в объектно-ориентированном Питоне. Это специальные методы, с помощью которых вы можете добавить в ваши классы «магию». Они всегда обрамлены двумя нижними подчеркиваниями (например, init или lt ). Ещё, они не так хорошо документированны, как хотелось бы. Все магические методы описаны в документации, но весьма беспорядочно и почти безо всякой организации. Поэтому, чтобы исправить то, что я воспринимаю как недостаток документации Питона, я собираюсь предоставить больше информации о магических методах, написанной на понятном языке и обильно снабжённой примерами. Надеюсь, это руководство вам понравится. Используйте его как обучающий материал, памятку или полное описание. http://habrahabr.ru/post/186608/"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: collections","loc":"http://pynsk.ru/posts/2015/Aug/09/tainstvo-standartnoi-biblioteki-collections/","text":"Модуль collections - предоставляет специализированные типы данных, на основе словарей, кортежей, множеств, списков. Этот модуль хорошо себя показывает при частой работе со словарями и списками. Например, данный модуль предоставляет возможность посчитать n наиболее часто встречающихся элементов, в порядке убывания встречаемости. Есть в этом модуле и словарь, который помнит порядок ключей. А еще есть структура, которая позволяет создать объект ведущий себя как кортеж, с тем дополнением, что каждому элементу присваивается имя, по которому можно в дальнейшем получать доступ. Заинтересовал? Вот ссылки для дальнейшего погружения в тему: https://docs.python.org/3.5/library/collections.html http://pythonworld.ru/moduli/modul-collections.html"},{"tags":"Таинство стандартной библиотеки","title":"Таинство стандартной библиотеки: datetime и calendar","loc":"http://pynsk.ru/posts/2015/Aug/09/tainstvo-standartnoi-biblioteki-datetime-i-calendar/","text":"Стандартная поставка Python содержит множество инструментов для решения задач. Например, для работы с датами отлично себя показывают datetime и calendar Модуль datetime предоставляет классы для обработки времени и даты разными способами. Поддерживается и стандартный способ представления времени, однако больший упор сделан на простоту манипулирования датой, временем и их частями. Модуль calendar позволяет напечатать себе календарик (а также содержит некоторые другие полезные функции для работы с календарями). Возможности этих модулей обширны. Стоит их рассмотреть внимательно. Для этого приведем ссылки: datetime: https://docs.python.org/2/library/datetime.html http://pythonworld.ru/moduli/modul-datetime.html http://pymotw.com/2/datetime/ calendar: https://docs.python.org/2/library/calendar.html http://pymotw.com/2/calendar/"},{"tags":"Пишем web-проекты","title":"Python и real-time web приложение","loc":"http://pynsk.ru/posts/2015/Aug/08/python-i-real-time-web-prilozhenie/","text":"Далеко не всегда требуется тащить мощный Django или другой фреймворк. Бывает достаточно небольшого количества чистого Python кода и базы данных. Посмотрим, как имея всего эти 2 элемента написать приложение. !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"},{"tags":"Полезные библиотеки","title":"Python + GUI == PyQt","loc":"http://pynsk.ru/posts/2015/Aug/08/python-gui-pyqt/","text":"Qt - это инструментарий для разработки на C++, который предоставляет огромный спектр возможностей: от рисования GUI, до написания низкоуровневых серверов. Часто Qt применяют для создания GUI, в том числе в интерактивном режиме - можно перемещать виджеты на формы. Qt имеет отличную докумементацию, а также имеет привязку для Python - PyQt и PySide. (вторая еще с Qt5 не умеет работать) Используя PyQt можно нарисовать формочку в редакторе, а затем буквально одной строчкой начать писать логику. https://wiki.python.org/moin/PyQt http://wiki.python.su/Документации/ВведениеВСредуPyQt4"},{"tags":"Python на службе народа","title":"Python как средство для определения \"хорошо/плохо\"","loc":"http://pynsk.ru/posts/2015/Aug/07/python-kak-sredstvo-dlia-opredeleniia-khoroshoplokho/","text":"Информации очень много. Хорошо бы уметь ее фильтровать. Хочется упомянуть такое средство фильтрации как анализ тональности. Это даже не фильтрация, но можно применять как фильтр. Sentiment analysis (по-русски, анализ тональности) — это область компьютерной лингвистики, которая занимается изучением мнений и эмоций в текстовых документах. С помощью анализа тональности можно определить, что текст N интересный, а текст M неинтересный - причем это сделает компьютер за вас. Для погружения в эту тему стоит почитать эти ссылки: - http://habrahabr.ru/post/149605/ - http://habrahabr.ru/post/263171/ - http://habrahabr.ru/post/197890/"},{"tags":"Полезные инструменты","title":"Утилиты написанные на Python: youtube-dl","loc":"http://pynsk.ru/posts/2015/Aug/07/utility-napisannye-na-python-youtube-dl/","text":"youtube-dl (https://github.com/rg3/youtube-dl/) - это очень популярный скрипт для выгрузки видео с сервиса Youtube (, Vimeo и других). Данная утилита позволяет очень легко выдернуть видео со страницы ютьюб. Множество настроек позволяют в том числе выдернуть субтитры, узнать длительность видео и многие другие параметры. Данную утилиту можно применить следующим образом: если у вас есть ряд каналов, которые вы смотрите регулярно, то часто задаетесь вопросом \"Вышло новое видео или нет?\". Чтобы не тыкаться по 10 раз на дню на сайт (плюс к этому, \"котики\" могут отвлечь на несколько часов), вы можете соединить несколько сервисов вместе и новые видео будут автоматически попадать к вам на компьютер."},{"tags":"Разное","title":"Что такое PEP?","loc":"http://pynsk.ru/posts/2015/Aug/06/chto-takoe-pep/","text":"Развитие языка Python происходит согласно чётко регламентированному процессу создания, обсуждения, отбора и реализации документов PEP. PEP - Python Enhancement Proposal - это предложения по развитию питона https://www.python.org/dev/peps/ Процесс PEP является основным механизмом для предложения новых возможностей и для документирования проектных решений, которые прошли в Python. Самым известным PEP является PEP8 - это свод рекомендаций в оформлению кода. Рекомендации написаны кровью из глаз программистов. https://www.python.org/dev/peps/pep-0008/"},{"tags":"Разное","title":"Python и базы данных: много баз - много модулей или один?","loc":"http://pynsk.ru/posts/2015/Aug/06/python-i-bazy-dannykh-mnogo-baz-mnogo-modulei-ili-odin/","text":"Без баз данных (БД) в современной разработке редко обходится. Питон не обделен и имеет множество модулей для работы с базами данных. Есть и специализированные, например, pymongo - модуль для MongoDB, есть и более обширные - sqlalchemy, PonyORB. sqlalchemy - это ORM для различных БД. Если просто, то это инструмент, написать структуру данных и работать с ней, а \"алхимия\" будет самостоятельно сохранять/подгружать из БД данные. sqlalchemy умеет работать со всеми популярными реляционными БД."},{"tags":"Извлечение информации","title":"Python и интересный парсинг сайтов","loc":"http://pynsk.ru/posts/2015/Aug/05/python-i-interesnyi-parsing-saitov/","text":"Излечение информации со страниц может быть интересным. Рекомендуем к просмотру видео !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"},{"tags":"Пишем web-проекты","title":"Bottle с Python","loc":"http://pynsk.ru/posts/2015/Aug/05/bottle-s-python/","text":"bottle - это веб-фреймворк для Python. Отличительной особенностью этого фреймворка является простота - исходный код занимает один файл. Несмотря на свою минималистичность, Bottle предоставляет довольно широкие возможности, которых на 100% хватает для мелких и средних проектов. Чтобы стартануть изучение достаточно написать: from bottle import route , run , template @route ( '/hello/<name>' ) def index ( name ): return template ( '<b>Hello {{name}}</b>!' , name = name ) run ( host = 'localhost' , port = 8080 ) Это запустит web-приложение на 8080 порту, а по ссылке http://127.0.0.1/hello/Alexander вы увидите Hello Alexander. Очень просто. Дальнейшее изучение можно продолжить по ссылкам: http://bottlepy.org/docs/dev/index.html http://habrahabr.ru/post/221659/ http://habrahabr.ru/post/250831/"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: модуль тестирования py.test","loc":"http://pynsk.ru/posts/2015/Aug/04/testy-testy-testy-modul-testirovaniia-pytest/","text":"Наряду с входящими в стандартную поставку питона средствами для тестирования, существуют и альтернативные инструменты, например, py.test. http://pytest.org/ py.test имеет множество расширений, которые значительно упрощают написание тестов. py.test имеет плагины для всех популярных web-фреймворков, с помощью плагинов позволяет кэшеировать результаты (успешных тестов), формировать отчеты в самых различных форматах. А также имеет очень простую систему расширения и вы можете буквально за день написать свой плагин. !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: создание читаемых отчетов","loc":"http://pynsk.ru/posts/2015/Aug/04/testy-testy-testy-sozdanie-chitaemykh-otchetov/","text":"Тесты тесты тесты: создание читаемых отчетов Когда в вашей программе очень много тестов, то возникают проблемы с чтением отчетов (что сломалось, что корректно отработало). Для создания читаемых отчетов можно порекомендовать allure-framework. О этом фреймворке можно узнать в видео: !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document); https://github.com/allure-framework"},{"tags":"Синтаксис Python","title":"Синтаксис Python: конструкция switch","loc":"http://pynsk.ru/posts/2015/Aug/03/sintaksis-python-konstruktsiia-switch/","text":"Стоит упомянуть про конструкцию switch в Python. Такой конструкции в языке нет, однако, выкрутится можно. Часто рекомендуют писать множественные elif'ы, но можно сделать так: def switch_case ( case ): return \"You entered \" + { '1' : \"one\" , '2' : \"two\" , '3' : \"three\" } . get ( case , \"an out of range number\" ) num = raw_input ( \"Input a number between 1 and 3: \" ) print switch_case ( num ) В этом примере мы создаем словарь, а затем получаем значение по нужному нам ключу. Вот только этот подход не работает, когда значение switch'а вычисляется в динамике. (Например, если мы приветствуем/прощаемся какого-то пользователя). result = { 'a' : lambda x : x * 5 , 'b' : lambda x : x + 7 , 'c' : lambda x : x - 2 }[ value ]( x ) В этом случае мы все также создаем словарь, но в качестве значений словаря прописываем функцию (в примере - lamdba функции). Затем получаем эту функцию словаря и вычисляем с аргументом. Еще способы реализации switch-case в Python: Recipe 410692: Readable switch construction without lambdas or dictionaries Recipe 410695: Exception-based Switch-Case Recipe 181064: Using a Dictionary in place of a 'switch' statement"},{"tags":"Синтаксис Python","title":"Синтаксис Python: трехместное выражение if/else","loc":"http://pynsk.ru/posts/2015/Aug/03/sintaksis-python-trekhmestnoe-vyrazhenie-ifelse/","text":"Сегодня хочется упомянуть о непонятной на первый взгляд конструкции - тернарная условная операция, или по-русски - трехместное выражение if/else . Представим, есть такой код: if X : A = Y else : A = Z довольно короткая, но, тем не менее, занимает целых 4 строки. Специально для таких случаев и было придумано выражение if/else : A = Y if X else Z В данной инструкции интерпретатор выполнит выражение Y, если X истинно, в противном случае выполнится выражение Z. >>> >>> A = 't' if 'spam' else 'f' >>> A 't' Синтаксис конструкции if-elif-else описан по ссылкам https://docs.python.org/3/tutorial/controlflow.html http://pythonworld.ru/osnovy/instrukciya-if-elif-else-proverka-istinnosti-trexmestnoe-vyrazhenie-ifelse.html"},{"tags":"Полезные модули","title":"Рисование svg графиков","loc":"http://pynsk.ru/posts/2015/Aug/02/risovanie-svg-grafikov/","text":"Для рисования векторных графиков (svg) подойдет библиотека pygal - http://pygal.org/ Данный модуль предоставляет широкий спектр возможностей, в частности можно нарисовать: Столбчатые диаграммы Линейные диаграммы XY диаграммы Круговые диаграммы Лепестковые диаграммы и другие"},{"tags":"Таинство стандартной библиотеки","title":"Статистический модуль в стандартной библиотеке","loc":"http://pynsk.ru/posts/2015/Aug/02/statisticheskii-modul-v-standartnoi-biblioteke/","text":"Статистический модуль теперь есть в стандартной библиотеке. Начиная с версии 3.4 в стандартной поставке Python появилось более продвинутое средство для работы с данными. Теперь нет необходимости писать руками методы average, median (вычисление среднего и медианы) и других. Ознакомьтесь с возможностями стандартного модуля: https://docs.python.org/3/library/statistics.html"},{"tags":"Полезные библиотеки","title":"Python + winapi","loc":"http://pynsk.ru/posts/2015/Aug/01/python-winapi/","text":"Пишите под windows, да еще и с Win API? Python здесь тоже может помочь, ведь для него есть библиотека pywin32 (http://sourceforge.net/projects/pywin32/). Данная библиотека предоставляет все базовые примитивы для работы с WinAPI."},{"tags":"Полезные модули","title":"click","loc":"http://pynsk.ru/posts/2015/Aug/01/click/","text":"Библиотека click ( http://click.pocoo.org/4/ ) позволяет с минимальными усилиями создать интерфейс командной строки. Создаете функцию, добавляете пару декораторов и готово. import click @click.command () @click.option ( '--count' , default = 1 , help = 'Number of greetings.' ) @click.option ( '--name' , prompt = 'Your name' , help = 'The person to greet.' ) def hello ( count , name ): ... А как вы создаете командные интерфейсы?"},{"tags":"Полезные библиотеки","title":"JSON DSL - JSL","loc":"http://pynsk.ru/posts/2015/Jul/31/json-dsl-jsl/","text":"Если вы широко используете JSON в своем проекте, то вам будет интересен DSL - JSL. JSL позволяет описывать модели, почти в какой-нибудь ORM, создавать объекты по этим моделям и как-то с ними работать. Интересный проект. https://github.com/aromanovich/jsl"},{"tags":"Разное","title":"Python - язык общего назначения","loc":"http://pynsk.ru/posts/2015/Jul/31/python-iazyk-obshchego-naznacheniia/","text":"Python - язык общего назначения, может применяться где угодно. Не верите? На странице https://www.python.org/about/success/ представлены сферы и названия компаний, которые применяют этот язык. Впечатляет."},{"tags":"Hardcore Python","title":"Python и real-time?","loc":"http://pynsk.ru/posts/2015/Jul/30/python-i-real-time/","text":"Возможно! Рассказ \"Управление памятью в real-time приложениях Python\" Антона Патрушева покажет как можно писать Python приложения с максимально быстрым откликом. https://events.yandex.ru/lib/talks/2075/"},{"tags":"Разное","title":"Сравнение R и Python","loc":"http://pynsk.ru/posts/2015/Jul/30/sravnenie-r-i-python/","text":"В последнее время любят сравнивать Python и R. Так давайте же почитаем сравнение этих двух языков. http://blog.dominodatalab.com/comparing-python-and-r-for-data-science/"},{"tags":"Извлечение информации","title":"Парсинг с помощью asyncio","loc":"http://pynsk.ru/posts/2015/Jul/29/parsing-s-pomoshchiu-asyncio/","text":"Парсинг сайтов это вечная задача. Сайтов много, данных много и все они разные. Для задач парсинга существует великое разнообразие инструментов. В Python 3-ей версии появился стандартный модуль для создания асинхронных программ. И грех не воспользоваться данной возможностью. Примером парсинга на asyncio может послужить эта статья http://olegwock.net/blog/python/byistryiy-parsing-na-python-s-pomoshhyu-asyncio/"},{"tags":"Пишем web-проекты","title":"Django REST API","loc":"http://pynsk.ru/posts/2015/Jul/29/django-rest-api/","text":"Пишите web приложения? Тогда для вас не является новостью, что без API далеко не уедешь. Для фреймворка django существует несколько способов создать API за пару минут, да еще и с документацией. https://github.com/tomchristie/django-rest-framework https://github.com/marcgibbons/django-rest-swagger"},{"tags":"Синтаксис Python","title":"Классы и функции","loc":"http://pynsk.ru/posts/2015/Jul/28/klassy-i-funktsii/","text":"До сих путаетесь между функциями, методами, классами и объектами? Пора разобраться в этом. Данная статья расскажет, что такое Bound и UnBound методы, как можно в динамике добавлять поля в объект, как перегружать методы. http://0agr.ru/blog/2011/05/03/advanced-python-%D0%BE%D0%B1%D1%8A%D0%B5%D0%BA%D1%82%D1%8B-%D0%BA%D0%BB%D0%B0%D1%81%D1%81%D1%8B-%D0%B8-%D0%B8%D1%85-%D0%BC%D0%B5%D1%82%D0%BE%D0%B4%D1%8B/"},{"tags":"Тесты тесты тесты","title":"Имитация файловой системы с помощью mock","loc":"http://pynsk.ru/posts/2015/Jul/28/imitatsiia-failovoi-sistemy-s-pomoshchiu-mock/","text":"Вы пишите тесты? Тогда вам знаком модуль mock (в Python3 находится в unittest). Это модуль, который позволяет сделать имитацию объекта. Это необходимо, когда пишите тесты на свой код, а этот код использует множество долгих приготовлений: сходить в БД, разобрать данные еще что-то. Вот в этом случае вы можете провести имитацию всех этих долгих приготовлений и сконцентрироваться на написании тестов для своего кода. В случае с файловой системой немного сложней. Вот надо какие-то файлы создавать,в них что-то писать. Засорять свою домашнюю директорию папками \"temp\"? Не обязательно, можно имитировать файловую систему с помощью mockfs. https://github.com/mockfs/mockfs"},{"tags":"Таинство стандартной библиотеки","title":"Регулярные выражения","loc":"http://pynsk.ru/posts/2015/Jul/27/reguliarnye-vyrazheniia/","text":"Предположим, у нас есть задача - выдрать из крупного текстового файла (файла с логами) все IPv4 (адреса клиентов, например). Как это можно сделать? Хорошим инструментом для решения этой задачи являются регулярные выражения. Регулярное выражение — это последовательность символов, используемая для поиска и замены текста в строке или файле. Возможно, вы уже встречались с записями типа: <([a-z]+)[&#94;>]*(?<!/)> Большая вероятность, что это было регулярное выражение. Регулярные выражения - это мощный инструмент, который стоит изучить и осознать. Не надо запоминать все конструкции, достаточно понять принцип. Для погружения в эту тему, рекомендуем эти материалы: http://tproger.ru/translations/regular-expression-python/ http://qntm.org/files/re/re.html http://habrahabr.ru/post/115825/ http://pep8.ru/doc/dive-into-python-3/7.html"},{"tags":"Таинство стандартной библиотеки","title":"Встроенные функции Python","loc":"http://pynsk.ru/posts/2015/Jul/27/vstroennye-funktsii-python/","text":"Стандартная библиотека Python отличается хорошей документацией и широким ассортиментом готовых решений. Python предоставляет без малого 68 встроенных функций: это получение модуля числа, бинарное и hex представления числа, различные преобразование типов, сложение, возведение в степень и многие другие. https://docs.python.org/3.5/library/functions.html А вы знали, что в Python всё является объектом? Даже число >>> dir ( 5 ) [ '__abs__' , '__add__' , '__and__' , .... , 'denominator' , 'imag' , 'numerator' , 'real' ]"},{"tags":"Таинство стандартной библиотеки","title":"PEP 471 (Python 3.5) добавил в модуль os новую функцию - scandir.","loc":"http://pynsk.ru/posts/2015/Jul/25/pep-471-python-35-dobavil-v-modul-os-novuiu-funktsiiu-scandir/","text":"PEP 471 (Python 3.5) добавил в модуль os новую функцию - scandir. Функция scandir возвращает генератор, который содержит директории по пути. Польза scandir состоит в производительности. Теперь os.listdir и os.walk будут работать в 2-20 раз быстрее. Пример: функция, которая возвращает генератор с директориями начинающиеся с точки: def subdirs ( path ): \"\"\"Yield directory names not starting with '.' under given path.\"\"\" for entry in os . scandir ( path ): if entry . name . startswith ( '.' ) and entry . is_dir (): yield entry . name"},{"tags":"Полезные библиотеки","title":"Tkinter","loc":"http://pynsk.ru/posts/2015/Jul/25/tkinter/","text":"Родным модулем для построения GUI интерфейсов для Python программ является Tkinter. Данная библиотека позволяет построить несложные интерфейсы. Tkinter есть на всех платформах где есть Python. В Python ветки 2.x.x при импорте модуля Tkinter, он пишется в большой буквы (иначе возникает ошибка). При импорте tkinter в версиях 3.x.x Питона имя модуля пишется с маленькой буквы. Данный курс - http://younglinux.info/tkinter.php - \"Создание GUI на Python с помощью библиотеки Tkinter\" знакомит с особенностями разработки графического интерфейса пользователя на основе языка программирования Python(создание виджет и обработчиков событий, связывание с событиями и др.)."},{"tags":"Python проекты","title":"Интерпретатор brainfuck на Python","loc":"http://pynsk.ru/posts/2015/Jul/25/interpretator-brainfuck-na-python/","text":"Язык brainfuck для хранения данных использует ячейки (по-хорошему бесконечное число ячеек) и состоит всего из восьми команд, поэтому выучить его будет легко. В этой статье показан интерпретатор brainfuck на Python http://pythonworld.ru/primery-programm/interpretator-brainfuck.html"},{"tags":"Полезные библиотеки","title":"Набор GUI библиотек для Python","loc":"http://pynsk.ru/posts/2015/Jul/25/nabor-gui-bibliotek-dlia-python/","text":"На странице Python-wiki представлен огромный список пакетов для создания GUI на Python https://wiki.python.org/moin/GuiProgramming"},{"tags":"Python проекты","title":"Disqus - самое крупное django приложением в web.","loc":"http://pynsk.ru/posts/2015/Jul/24/disqus-samoe-krupnoe-django-prilozheniem-v-web/","text":"Disqus — веб-сервис, который предоставляет возможность добавить форму для интернет-обсуждений и комментариев на сайт пользователя использует Python. Сервис использует Python (Django). По заверениям Disqus - они являются самым крупным django приложением в web. https://disqus.com/"},{"tags":"Разное","title":"TIOBE за июль 2015: Python находится на 5-ом месте","loc":"http://pynsk.ru/posts/2015/Jul/24/tiobe-za-iiul-2015-python-nakhoditsia-na-5-om-meste/","text":"По рейтингу TIOBE за июль 2015 Python находится на 5-ом месте, год назад был на 8-ом. http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html"},{"tags":"Внутренности Python","title":"Интересно как работает Python?","loc":"http://pynsk.ru/posts/2015/Jul/23/interesno-kak-rabotaet-python/","text":"Интересно как работает Python? Рекомендуем изучить материалы: Интерпретатор Python: о чём думает змея? (часть I-III) - http://habrahabr.ru/post/206420/ Python изнутри. Введение - habrahabr.ru/company/buruki/blog/189972/ Python изнутри. Объекты. Голова - habrahabr.ru/company/buruki/blog/189986/ Python изнутри. Объекты. Хвост - habrahabr.ru/company/buruki/blog/190336/ Python изнутри. Структуры процесса - habrahabr.ru/company/buruki/blog/191032/"},{"tags":"Внутренности Python","title":"Как работает Python?","loc":"http://pynsk.ru/posts/2015/Jul/23/kak-rabotaet-python/","text":"Как работает Python, что такое интерпретатор, как работает компилятор и что такое байт-код, далее расскажу о виртуальной машине (PVM) и о производительности Python. Также о альтернативных реализациях интерпретатора. http://adw0rd.com/2009/08/22/python-howto-work/"},{"tags":"Полезные модули","title":"Django DB Mailer - батарейка для отправки email","loc":"http://pynsk.ru/posts/2015/Jul/22/django-db-mailer-batareika-dlia-otpravki-email/","text":"В подавляющем большинстве проектов используется отправка сообщений на почтовые адреса клиентов/админов/отделов. На сколько утомительно каждый раз создавать шаблоны на файловой системе, задавать сигналы, использовать часто дублирующийся код для рендеринга и отправки. В конечном итоге встают задачи о фоновой отправке, об изменениях отправителя, приоритизации, повторной отправке сообщения в случае неудачи, частом редактировании по просьбе клиента/маркетологов, прикреплению к письму стандартных файлов в виде каких-то инструкций по применению продукта, или же стандартных документов, отчетов по клиентам, переводам и тд и тп. В больших проектах часто необходимо визуально разделять шаблоны на категории, для фильтрации, дабы не тратить время на редактирование менее важных шаблонов при рефакторинге, и во избежание путаницы с новым контентом, или при работе со старым. Для подобных решений существует простая батарейка, призванная решить большинство подобных проблем, и избавить Вас от лишнего кода, сопровождения и нервотрепки. http://habrahabr.ru/post/253445/"},{"tags":"Полезные модули","title":"requests","loc":"http://pynsk.ru/posts/2015/Jul/22/requests/","text":"requests - http://docs.python-requests.org/en/latest/ - универсальный (для python2, python3) модуль для создание HTTP запросов. Данный модуль позволяет очень просто послать запрос, получить данные. >>> r = requests . get ( 'https://api.github.com/user' , auth = ( 'user' , 'pass' )) >>> r . status_code 200 >>> r . headers [ 'content-type' ] 'application/json; charset=utf8' >>> r . encoding 'utf-8' >>> r . text u'{\"type\":\"User\"...' >>> r . json () { u'private_gists' : 419 , u'total_private_repos' : 77 , ... }"},{"tags":"Тесты тесты тесты","title":"Тесты тесты тесты: unittest - основной инструмент тестирования","loc":"http://pynsk.ru/posts/2015/Jul/21/testy-testy-testy-unittest-osnovnoi-instrument-testirovaniia/","text":"Одним из основных инструментов для тестирования в Python - unittest Это стандартный модуль для реализации юнит-тестов на Python. Unittest это порт JUnit с Java, иными словами ООП стиль, что весьма удобно для тестирования и процедур, и классов. Возможностей в данном модуле довольно много: проверки ( assert* ), декораторы, позволяющие пропустить отдельный тест ( @skip , @skipIf ) или обозначить сломанные тесты ( @expectedFailure ) При написании тестов надо исходит из следующих принципов: Работа теста не должна зависеть от результатов работы других тестов. Тест должен использовать данные, специально для него подготовленные, и никакие другие. Тест не должен требовать ввода от пользователя Тесты не должны перекрывать друг друга (не надо писать одинаковые тесты 20 раз). Можно писать частично перекрывающие тесты. Нашли баг -> напиши тест Тесты надо поддерживать в рабочем состоянии Модульные тесты не должны проверять производительность сущности (класса, функции) Тесты должны проверять не только то, что сущность работает корректно на корректных данных, но и то что ведет себя адекватно при некорректных данных."},{"tags":"Тесты тесты тесты","title":"unittest","loc":"http://pynsk.ru/posts/2015/Jul/21/unittest/","text":"unittest - https://docs.python.org/3.5/library/unittest.html - фреймворк для написания юнит-тестов. unittest является частью стандартной поставки."},{"tags":"Синтаксис Python","title":"Генераторы списков","loc":"http://pynsk.ru/posts/2015/Jul/20/generatory-spiskov/","text":"Если вы использовали Python достаточно долго, вы должны были хотя бы слышать о понятии «list comprehensions». Это способ уместить цикл for, блок if и присваивание в одну строку. Генератор списков - яркий пример «синтаксического сахара». То есть конструкции, без которой легко можно обойтись, но с ней намного лучше :) Генераторы списков, как это не странно, предназначены для удобной обработки списков, к которой можно отнести и создание новых списков, и модификацию существующих. Допустим, нам необходимо получить список нечетных чисел, не превышающих 25. В принципе, только познакомившись с работой команды xrange решить эту проблему несложно. >>> res = [] >>> for x in xrange ( 1 , 25 , 2 ): ... res . append ( x ) ... >>> print res В общем-то, полученный результат — целиком нас устраивает всем, кроме длинной записи. тут-то на помощь и придет наш «сахарок». В самом простом виде, он обычно >>> res = [ x for x in xrange ( 1 , 25 , 2 )] >>> print res [ 1 , 3 , 5 , 7 , 9 , 11 , 13 , 15 , 17 , 19 , 21 , 23 ] В общем виде эта конструкция такова: python [stmt for var in iterable if predicate] По-мимо генератора списка есть синтаксический сахар - генератор словарей."},{"tags":"Разное","title":"Почему Python клёвый?","loc":"http://pynsk.ru/posts/2015/Jul/20/pochemu-python-kliovyi/","text":"Видео с конференции PyCon В видео докладчик рассказал о плюсах Python. О тех самых преимуществах, которые не надо обходить стороной. !function(a){ var b=\"embedly-platform\",c=\"script\"; if(!a.getElementById(b)){ var d=a.createElement(c); d.id=b; d.src=(\"https:\"===document.location.protocol?\"https\":\"http\")+\"://cdn.embedly.com/widgets/platform.js\"; var e=document.getElementsByTagName(c)[0];e.parentNode.insertBefore(d,e)} }(document);"}]}